{
  "The Shawshank Redemption (1994)": "In 1947 Portland, Maine, banker Andy Dufresne is convicted of murdering his wife and her lover and is sentenced to two consecutive life sentences at the Shawshank State Penitentiary. He is befriended by Ellis \"Red\" Redding, an inmate and prison contraband smuggler serving a life sentence. Red procures a rock hammer and a large poster of Rita Hayworth for Andy. Assigned to work in the prison laundry, Andy is frequently sexually assaulted by \"the Sisters\" and their leader, Bogs.\n\nIn 1949, Andy overhears the captain of the guards, Byron Hadley, complaining about being taxed on an inheritance and offers to help him shelter the money legally. After an assault by the Sisters nearly kills Andy, Hadley beats and cripples Bogs, who is subsequently transferred to another prison. Andy is not attacked again. Warden Samuel Norton meets Andy and reassigns him to the prison library to assist elderly inmate Brooks Hatlen, a front to allow Andy to manage financial matters for other prison staff, guards from other prisons, and the warden himself. Andy begins writing weekly letters to the state legislature requesting funds to improve the prison's decaying library.\n\nBrooks is paroled in 1954 after serving 50 years, but he cannot adjust to the outside world and eventually hangs himself. The legislature sends a library donation that includes a recording of The Marriage of Figaro; Andy plays an excerpt over the public address system and is punished with solitary confinement. After his release from solitary, Andy explains that hope is what gets him through his time, a concept that Red dismisses. In 1963, Norton begins exploiting prison labor for public works, profiting by undercutting skilled labor costs and receiving bribes. Andy launders the money using the alias \"Randall Stephens\".\n\nTommy Williams is incarcerated for burglary in 1965. Andy and Red befriend him, and Andy helps him pass his GED exam. A year later, Tommy reveals to Red and Andy that his cellmate at another prison had claimed responsibility for the murders for which Andy was convicted. Andy approaches Norton with this information, but Norton refuses to listen, and when Andy mentions the money laundering, Norton sends him back to solitary confinement. Norton has Hadley murder Tommy under the guise of an escape attempt. Andy attempts to discontinue the laundering, but relents after Norton threatens to destroy the library, remove Andy's protection from the guards, and move him to worse conditions. Andy is released from solitary confinement after two months, and he tells a skeptical Red that he dreams of living in Zihuatanejo, a Mexican coastal town. Andy also tells him of a specific hayfield near Buxton, asking Red—once he is released—to retrieve a package that Andy buried there. Red worries about Andy's well-being, especially when he learns Andy asked a fellow inmate for 6 ft (1.8 m) of rope.\n\nAt the next day's roll call, the guards find Andy's cell empty. An irate Norton throws a rock at a poster of Raquel Welch hanging on the cell wall, revealing a tunnel that Andy dug with his rock hammer over the past 19 years. The previous night, Andy used the rope to escape through the tunnel and prison sewage pipe, taking Norton's suit, shoes, and ledger, containing proof of the money laundering. While guards search for him, Andy poses as Randall Stephens, withdraws over $370,000 (equivalent to $2.92 million in 2019) of the laundered money from several banks, and mails the ledger and other evidence of the corruption and murders at Shawshank to a local newspaper. State police arrive at Shawshank and take Hadley into custody, while Norton commits suicide to avoid arrest.\n\nThe following year, Red is finally paroled after serving 40 years. He struggles to adapt to life outside prison and fears that he never will. Remembering his promise to Andy, he visits Buxton and finds a cache containing money and a letter asking him to come to Zihuatanejo. Red violates his parole by traveling to Fort Hancock, Texas, and crossing the border into Mexico, admitting that he finally feels hope. He finds Andy on a beach in Zihuatanejo, and the two reunited friends happily embrace.",
  "The Godfather (1972)": "In 1945 New York City, at his daughter Connie's wedding to Carlo, Vito Corleone, the don of the Corleone crime family listens to requests. His youngest son, Michael, who was a Marine during World War II, introduces his girlfriend, Kay Adams, to his family at the reception. Johnny Fontane, a popular singer and Vito's godson, seeks Vito's help in securing a movie role; Vito dispatches his consigliere, Tom Hagen, to Los Angeles to persuade studio head Jack Woltz to give Johnny the part. Woltz refuses until he wakes up in bed with the severed head of his prized stallion.\n\nShortly before Christmas, drug baron Sollozzo, backed by the Tattaglia crime family, asks Vito for investment in his narcotics business and protection through his political connections. Wary of involvement in a dangerous new trade that risks alienating political insiders, Vito declines. Suspicious, Vito sends his enforcer, Luca Brasi, to spy on them. Brasi is garroted to death during his first meeting with Bruno Tattaglia and Sollozzo. Later, Sollozzo kidnaps Hagen, then has Vito gunned down in the street. Vito's eldest son Sonny takes command, Sollozzo pressures Hagen to persuade Sonny to accept Sollozzo's deal, then releases him. The family receives fish wrapped in Brasi's bullet-proof vest, indicating that Luca \"sleeps with the fishes\". Vito survives, and at the hospital, Michael thwarts another attempt on his father. Michael's jaw is broken by NYPD Capt. McCluskey, Sollozzo's unofficial bodyguard. Sonny retaliates with a hit on Tattaglia's son. The Corleones plot to murder Sollozzo and McCluskey; feigning a desire to settle the dispute, Michael meets them in a Bronx restaurant in which, after retrieving a handgun planted by Peter Clemenza, a Corleone capo, he kills both men.\n\nDespite a clampdown by the authorities, war breaks out between the Five Families and Vito fears for his family. Michael takes refuge in Sicily and his elder brother Fredo is sheltered by Moe Greene in Las Vegas. Sonny attacks Carlo on the street for abusing Connie and threatens to kill him if it happens again. When it does, Sonny speeds to their home but is ambushed at a highway toll booth and violently murdered by rival gangsters wielding submachine guns. While in Sicily, Michael meets and marries Apollonia, but a car bomb intended for him takes her life.\n\nDevastated by Sonny's death and realizing that the Tattaglias are controlled by the now-dominant don, Barzini, Vito attempts to end the feud. He assures the Five Families that he will withdraw his opposition to their heroin business and forgo avenging Sonny's murder. His safety guaranteed, Michael returns home to enter the family business and marry Kay, promising her that the business will be legitimate within five years. Kay gives birth to two children by the early 1950s. With his father nearing the end of his life and Fredo too weak, Michael takes the family reins, starting to move the family's business to Las Vegas. Expecting trouble due to this move, he insists Hagen also relocate to Las Vegas but relinquish his role to Vito because Hagen is not a \"wartime consigliere\". Vito agrees Hagen should \"have no part in what will happen\" in the coming battles with the rival families. When Michael travels to Las Vegas to buy out Greene's stake in the family's casinos, he is dismayed to see that Fredo is more loyal to Greene than to his own family.\n\nIn 1955, after warning Michael that whoever agrees to arrange a meeting between him and Barzini is a traitor, Vito suffers a fatal heart attack. At the funeral, Tessio, a Corleone capo, asks Michael to meet with Barzini, with the meeting set for the same day as the baptism of Connie's baby. While Michael stands at the altar as the child's godfather, Corleone hitmen murder the other New York City dons and Greene. Tessio's treachery leads to his execution. Michael extracts Carlo's confession to his complicity in setting up Sonny's murder for Barzini; Clemenza garrotes Carlo to death. Connie accuses Michael of the murder, telling Kay that Michael ordered all of the killings. Kay is at first relieved when Michael denies it, but later dismayed when she watches the capos arrive to pay reverence to her husband as Don Corleone and their closing the door on her.",
  "The Godfather Part II (1974)": "The film intercuts between events some time after The Godfather and the early life of Vito Corleone.\n\nIn 1901, the family of nine-year-old Vito Andolini is killed in Corleone, Sicily, after his father insults local Mafia chieftain Don Ciccio. Vito escapes on a ship to New York City, and is registered as \"Vito Corleone\" on Ellis Island. In 1917, having settled in New York, he marries and has a son, whom he names Santino (\"Sonny\"), with his wife. He loses his job due to the interference of a local don, Fanucci; Clemenza invites Vito to take part in a burglary unwittingly.\n\nVito has two more sons, Fredo and Michael. Vito's criminal conduct attracts the attention of Fanucci, who extorts him. Vito's partners, Clemenza and Salvatore Tessio, suggest paying him, but Vito insists Fanucci will accept a smaller payment if they make him \"an offer he don't refuse\". During a neighborhood festa, he stalks Fanucci to his apartment and shoots him dead. Vito becomes a respected and successful member of the community and is approached for help by a widow who is being evicted. After the widow's landlord learns of Vito's reputation, he agrees to let the widow stay on very favorable terms. Vito, along with his family, visits Sicily for the first time since emigrating. He and business partner Tommasino are admitted to Don Ciccio's compound, ostensibly to ask for Ciccio's blessing on their olive oil business. Vito exacts vengeance, killing Ciccio after revealing his former identity.\n\nIn the 1940s, the Corleone family gathers in their dining room to surprise Vito for his birthday. Michael announces that, in response to the attack on Pearl Harbor, he has left college and enlisted in the United States Marine Corps, leaving Sonny furious, Tom incredulous, and Fredo the only supportive brother. When Vito is heard at the door, all but Michael leave the room to greet him.\n\nIn 1958, during his son's First Communion party at Lake Tahoe, Michael has a series of meetings in his role as the don of the Corleone crime family. Frank Pentangeli, a Corleone capo, is dismayed that Michael refuses to help defend his territory against the Rosato brothers, who work for Hyman Roth, a long-standing Corleone business partner. That night, Michael leaves Nevada after surviving an assassination attempt at his home.\n\nMichael suspects Roth planned the assassination, but feigns ignorance when they meet. In New York City, Pentangeli attempts to maintain Michael's pretense by making peace with the Rosato family but they try to kill him. Roth, Michael, and several of their partners travel to Havana to discuss their future Cuban business prospects under the cooperative government of Fulgencio Batista. Michael becomes reluctant after reconsidering the viability of the ongoing Cuban Revolution. On New Year's Eve, Fredo inadvertently reveals that he knows Roth's right-hand man, Johnny Ola, having previously claimed that they had never met, and Michael realizes that it was Fredo who had betrayed him. Michael orders his bodyguard to kill Ola and Roth, but the bodyguard is killed by the police as he is attempting to assassinate Roth with a pillow in his hospital bed. Batista abdicates due to rebel advances. During the ensuing chaos, Michael, Fredo, and Roth separately escape to the United States. Back home, Michael learns that his wife Kay has miscarried.\n\nIn Washington, D.C., a Senate committee on organized crime is investigating the Corleone family. Pentangeli agrees to testify against Michael, who he believes had double-crossed him, and is placed under witness protection. On returning to Nevada, Fredo tells Michael that he felt resentful for being disregarded. He claims to be ignorant of the plot on Michael's life and informs Michael that the Senate lawyer is on Roth's payroll. Michael disowns Fredo but orders a capo to continue protecting him while their mother is alive. Michael sends for Pentangeli's brother from Sicily, resulting in Pentangeli renouncing his previous statement; the hearing dissolves in an uproar. Kay reveals to Michael that she actually had an abortion, not a miscarriage and that she intends to remove their children from Michael's criminal life. Outraged, Michael strikes Kay, banishes her from the family, and takes custody of the children.\n\nMichael's mother dies and Michael moves to wrap up loose ends. Roth is forced to return to the United States after being refused asylum and entry to Israel. Michael orders capo Rocco Lampone to assassinate Roth, who shoots Roth dead at Miami International Airport. At the witness protection compound, consigliere Tom Hagen reminds Pentangeli that failed plotters against the Roman Emperor often committed suicide, in return for clemency for their families, and assures him that his family will be cared for, as long as he agrees to do this. Pentangeli slits his wrists in his bathtub. Al Neri, acting on Michael's orders, kills Fredo.",
  "The Dark Knight (2008)": "A gang of criminals robs a Gotham City mob bank, murdering each other for a higher share until only the Joker remains; he escapes with the money. Batman, District Attorney Harvey Dent and Lieutenant Jim Gordon form an alliance to rid Gotham of organized crime. Bruce Wayne is impressed with Dent's idealism and offers to support his career; he believes that, with Dent as Gotham's protector, he can give up being Batman and lead a normal life with Rachel Dawes—even though she and Dent are dating.\n\nMob bosses Sal Maroni, Gambol, and the Chechen hold a videoconference with their corrupt accountant, Lau, who has hidden their funds for safekeeping and fled to Hong Kong. The meeting is interrupted by the Joker, who warns them that Batman is unhindered by the law, and offers to kill him in exchange for half of their money. After Joker kills Gambol and takes over his gang, the mob ultimately decides to accept the offer.\n\nBatman finds Lau in Hong Kong and brings him back to Gotham to testify, allowing Dent to apprehend the entire mob. The Joker threatens a string of murders unless Batman reveals his identity, and starts by killing Police Commissioner Gillian B. Loeb and Judge Surillo, who is presiding over the mob trial. The Joker also targets Mayor Anthony Garcia, but Gordon sacrifices himself to stop the assassination. Dent learns that Rachel is the next target.\n\nBruce decides to reveal his identity. Before he can, however, Dent announces that he is Batman. Dent is taken into protective custody, but the Joker appears and attacks the convoy. Batman comes to Dent's rescue and Gordon, who faked his death, apprehends the Joker, securing a promotion to Commissioner. Rachel and Dent are escorted away by detectives on Maroni's payroll; Gordon later learns that they never arrived home. Batman interrogates the Joker, who reveals that they have been trapped in separate locations rigged with explosives. Batman races to save Rachel, while Gordon attempts to rescue Dent. Batman arrives at the site but realizes that the Joker sent him to Dent's location instead. Both buildings explode, killing Rachel and disfiguring half of Dent's face. The Joker escapes with Lau, whom he later kills along with the Chechen.\n\nColeman Reese, an accountant at Wayne Enterprises, deduces that Bruce is Batman and tries to go public with the information. Not wanting Reese's revelation to interfere with his plans, the Joker threatens to destroy a hospital unless someone kills Reese within the hour. Gordon orders the evacuation of all hospitals in Gotham and goes to secure Reese. The Joker gives Dent a gun and convinces him to seek revenge for Rachel's death, then destroys the hospital and escapes with a busload of hostages. Dent goes on a killing spree, as the vigilante Two-Face, deciding the fates of people he holds responsible for Rachel's death by flipping his lucky coin—one side having been scorched in the explosion.\n\nAfter announcing Gotham will be subject to his rule come nightfall, the Joker rigs two evacuating ferries with explosives, one containing civilians and the other containing prisoners. He threatens to blow them both up by midnight, but will let one ferry live if its passengers (who have been supplied the detonator to the other boat's explosives) blow up the other. Batman finds the Joker by exploiting the sonar capabilities of all phones in the city, with the reluctant help of Lucius Fox. Both the civilians and the prisoners refuse to kill each other, while Batman apprehends the Joker after a brief fight. Before the SWAT arrive to take the Joker into custody, he gloats that Gotham's citizens will lose hope once Dent's rampage becomes public knowledge.\n\nGordon and Batman arrive at the building where Rachel perished, and encounter Two-Face, who has kept Gordon's family as hostages. Two-Face shoots Batman, and threatens to kill Gordon's son, claiming that Gordon's negligence is responsible for Rachel's death. Before he flips his coin for the boy, Batman, who was wearing body armor, tackles Two-Face off the building to his death. Batman persuades Gordon to hold him responsible for the killing spree and preserve Dent's heroic image. Dent is hailed as a hero and the police launch a manhunt for Batman. Gordon destroys the Bat-signal, Fox watches as the sonar device self-destructs, and Alfred Pennyworth burns a letter from Rachel saying she planned to marry Dent.",
  "12 Angry Men (1957)": "In the overheated jury room of the New York County Courthouse, a jury prepares to deliberate the case of an 18-year-old impoverished youth accused of stabbing his father to death. The judge instructs them that if there is any reasonable doubt, the jurors are to return a verdict of not guilty; if found guilty, the defendant will receive a death sentence. The verdict must be unanimous.\n\nAt first, the evidence seems convincing: a neighbor testified to witnessing the defendant stab his father from her window. Another neighbor testified that he heard the defendant threaten to kill his father and the father's body hitting the ground, and then, through his peephole, saw the defendant run past his door. The boy has a violent past and had recently purchased a switchblade of the same type as was found at the murder scene, but claimed he lost it. The knife at the scene had been cleaned of fingerprints.\n\nThe jurors at first seem to take the decision lightly. Juror 7 in particular is anxious to catch his tickets to the baseball game. In a preliminary vote conducted by Juror 1, all jurors vote guilty except Juror 8, who believes that there should be some discussion before the verdict is made. He questions the reliability of the witnesses’ testimonies and also throws doubt on the supposed uniqueness of the murder weapon by producing an identical switchblade from his pocket. He says he cannot vote guilty because reasonable doubt exists. With his arguments seemingly failing to convince any of the other jurors, Juror 8 suggests a secret ballot, from which he will abstain; if all the other jurors still vote guilty, he will acquiesce. The ballot reveals one not guilty vote. Juror 3 immediately accuses Juror 5 (who previously said they grew up in the slums like the defendant). As the two bicker, Juror 9 reveals that he changed his vote, respecting Juror 8's motives and agreeing there should be more discussion.\n\nJuror 8 argues that the noise of a passing train would have obscured the threat the second witness claimed to have overheard. Juror 5 changes his vote, as does Juror 11, who believes the defendant, had he truly killed his father, would not have returned to the crime scene several hours later to retrieve the murder weapon as it had already been cleaned of fingerprints. Juror 8 points out that people often say \"I'm going to kill you\" without literally meaning it.\n\nJurors 5, 6, and 8 further question the second witness's story. Juror 3 is infuriated, and after a verbal argument, tries to attack Juror 8, shouting \"I'll kill him!\", proving Juror 8's point about the defendant's words. Jurors 2 and 6 change their votes; the jury is now evenly split.\n\nJuror 4 doubts the defendant's alibi, based on the boy's inability to recall certain details regarding his alibi. Juror 8 tests Juror 4's own memory. He is able to remember events from the previous week, with difficulty similar to the defendant. Jurors 2, 3, and 8 debate whether the defendant could have stabbed his much-taller father from a downward angle, eventually deciding it was physically possible, though awkward. Juror 5 points out that someone who knew how to use a switchblade would have instead stabbed underhand at an upwards angle.\n\nJuror 7 half-heartedly changes his vote, leading to an inquisition by Juror 11. Under duress Juror 7 sloppily says he thinks the boy is not guilty. After another vote, Jurors 12 and 1 also change their votes, leaving only three guilty votes. Juror 10 erupts in vitriol regarding the defendant's ethnicity. The rest of the jurors, except Juror 4, stand up to turn their backs to him. When he bemoans that nobody is listening to him, Juror 4 states that he has, and tells him to sit down and be quiet. Juror 10 then walks over to a desk in the corner, now isolated. Juror 8 makes a statement about reasonable doubt before having the rest of the jurors return to the case. Juror 4 declares that the woman who saw the killing from across the street stands as solid evidence. Juror 12 reverts to a guilty vote.\n\nAfter watching Juror 4 rub his nose, irritated by impressions from his eyeglasses, Juror 9 realizes that the first witness had the same impressions on her nose as well, indicating that she wore eyeglasses as well but did not wear them to court. The other jurors begin to chime in about this new breakthrough. Juror 8 reasons that the witness, who was trying to sleep when she saw the killing, was not wearing her eyeglasses when it happened and she would not have had time to put them on to get a clear view of the person who did the stabbing, making her story dubious. Juror 8 goes around the room to question Jurors 12, 10 & 4 (in that order) about changing their vote. The remaining jurors, except Juror 3, change their vote to not guilty.\n\nJuror 3 gives an increasingly tortured string of arguments, building on earlier remarks about his strained relationship with his own son. In a moment of rage, Juror 3 tears up a photograph of him and his son before breaking down sobbing. He mutters not guilty, making the vote unanimous. As the others leave, Juror 8 helps the distraught Juror 3 with his coat. The defendant is found not guilty off-screen and the jurors leave the courthouse. In a brief epilogue, Jurors 8 (Davis) and 9 (McCardle) introduce each other for the first time by their names before parting.",
  "Schindler's List (1993)": "In Kraków during World War II, the Germans force local Polish Jews into the overcrowded Kraków Ghetto. Oskar Schindler, an ethnic German from Czechoslovakia, arrives in the city hoping to make his fortune. A member of the Nazi Party, Schindler bribes Wehrmacht (German armed forces) and SS officials and acquires a factory to produce enamelware. To help him run the business, Schindler enlists the aid of Itzhak Stern, a Jewish official who has contacts with black marketeers and the Jewish business community. Stern helps Schindler arrange financing for the factory. Schindler maintains friendly relations with the Nazis and enjoys wealth and status as \"Herr Direktor\", and Stern handles administration. Schindler hires Jewish workers because they cost less, while Stern ensures that as many people as possible are deemed essential to the German war effort, which saves them from being transported to concentration camps or killed.\n\nSS-Untersturmführer (second lieutenant) Amon Göth arrives in Kraków to oversee construction of Płaszów concentration camp. When the camp is completed, he orders the ghetto liquidated; many people are killed in the process. Schindler witnesses the massacre and is profoundly affected. He particularly notices a young girl in a red coat as she hides from the Nazis, and later sees her body among a wagonload of corpses. Schindler is careful to maintain his friendship with Göth and, through bribery, continues to enjoy SS support. Göth brutalizes his Jewish maid Helen Hirsch and randomly shoots people from the balcony of his villa; the prisoners are in constant fear for their lives. As time passes, Schindler's focus shifts from making money to trying to save as many lives as possible. To better protect his workers, Schindler bribes Göth into allowing him to build a sub-camp.\n\nAs the Germans begin losing the war, Göth is ordered to ship the remaining Jews at Płaszów to Auschwitz concentration camp. Schindler asks Göth to allow him to move his workers to a munitions factory he plans to build in Brünnlitz near his home town Zwittau. Göth agrees, but charges a huge bribe. Schindler and Stern create \"Schindler's List\" – a list of 850 people to be transferred to Brünnlitz instead of Auschwitz.\n\nAs the Jewish workers are transported by train to Brünnlitz, the one carrying the women and girls is accidentally redirected to Auschwitz-Birkenau; Schindler bribes Rudolf Höss, the commandant of Auschwitz, to win their release. At the new factory, Schindler forbids the SS guards from entering the factory floor without permission and encourages the Jews to observe the Jewish Sabbath. Over the next seven months, he spends much of his fortune bribing Nazi officials and buying shell casings from other companies; due to Schindler's machinations, the factory does not produce any usable armaments. Schindler runs out of money in 1945, just as Germany surrenders.\n\nAs a Nazi Party member and war profiteer, Schindler must flee the advancing Red Army to avoid capture. The SS guards in Schindler's factory have been ordered to kill the Jewish workforce, but Schindler persuades them to \"return to [their] families as men, instead of murderers\". He bids farewell to his workers and prepares to head west, hoping to surrender to the Americans. The workers give Schindler a signed statement attesting to his role in saving Jewish lives and present him with a ring engraved with a Talmudic quotation: \"Whoever saves one life saves the world entire\". Schindler is touched but also ashamed, as he feels he should have done more. The workers comfort Schindler and they exchange tearful farewells before he and his wife leave. When the Schindlerjuden awaken the next morning, a Soviet soldier announces that they have been liberated. The Jews walk to a nearby town.\n\nAn epilogue reveals that Schindler's marriage failed after the war, as did his attempts to start new businesses, while Göth was executed for crimes against humanity. Schindler was later honored by Yad Vashem for his efforts to save his workers from being killed. In the present, many of the surviving Schindlerjuden and the actors portraying them visit Schindler's grave and place stones on its marker (the traditional Jewish sign of respect on visiting a grave), with Liam Neeson laying two roses.",
  "The Lord of the Rings: The Return of the King (2003)": "Two Hobbits, Sméagol and his cousin, Déagol, are fishing when Déagol discovers the One Ring in the river. Sméagol's mind is ensnared by the Ring, and he kills his cousin for it. He retreats into the Misty Mountains as the Ring twists his body and mind until he becomes the creature Gollum.\n\nCenturies later, during the War of the Ring, Gandalf leads Aragorn, Legolas, Gimli, and King Théoden to Isengard, where they reunite with Merry and Pippin. Gandalf retrieves Saruman's palantír, and the group returns to Edoras to celebrate their victory at Helm's Deep. That night, Pippin looks into the palantír and is seen by Sauron. From Pippin's description of his visions, Gandalf surmises that Sauron will attack Gondor's capital Minas Tirith. He rides there to warn Gondor's steward Denethor, taking Pippin with him.\n\nGollum leads Frodo Baggins and Samwise Gamgee to Minas Morgul, where they watch the Witch-king of Angmar, leader of the nine Nazgûl, lead an army of Orcs towards Gondor. The hobbits begin climbing a stair carved in the cliff face that leads to a secret tunnel into Mordor, unaware that Gollum plans to kill them and take the Ring. The Witch-king and his forces strike and overwhelm Osgiliath, forcing Faramir and his garrison to retreat to Minas Tirith.\n\nGollum disposes of the Hobbits' food, blaming Sam. Believing that Sam desires the Ring, Frodo tells him to go home before he and Gollum continue to the tunnel leading to Mordor. Gollum tricks him into venturing into the lair of the giant spider Shelob. Frodo narrowly escapes and confronts Gollum, telling him that he must destroy the Ring for both their sakes. Gollum attacks Frodo but falls down a chasm. Frodo continues on, but Shelob discovers, paralyses, and binds him. Sam returns and wounds Shelob, driving her away, but then hides as Orcs appear and take Frodo with them. The Orcs prepare to execute Frodo, but they end up fighting each other over ownership of Frodo's mithril vest; the distraction allows Sam to rescue Frodo, and they escape before going on to continue their journey.\n\nAs King Théoden gathers the Rohirrim army, Aragorn learns from Elrond that Arwen is dying, having refused to leave Middle-Earth to be with Aragorn after seeing a vision of their future son. Elrond gives Aragorn Andúril, reforged from the shards of King Elendil's sword Narsil, so that Aragorn can reclaim his birthright and gain reinforcements from the ghostly Dead Men of Dunharrow. Joined by Legolas and Gimli, Aragorn travels to the Dead Men's lair, pledging to release them from Isildur's undead curse should they come to Gondor's aid.\n\nFaramir is gravely wounded after a futile effort to recapture Osgiliath; believing his son to be dead, Denethor falls into madness. Gandalf is left to defend the city against the Orc army, led by Gothmog. As Gothmog's army forces its way into the city, Denethor attempts to kill himself and Faramir on a pyre. Pippin alerts Gandalf and they save Faramir, but a burning Denethor leaps to his death from the top of Minas Tirith just before Théoden and his nephew, Éomer, arrive with the Rohirrim. During the ensuing battle, they are overwhelmed by the Oliphaunt-riding Haradrim and the Witch-King mortally wounds Théoden. Just as the Witch-king prepares to finish Théoden off, his niece Éowyn battles and manages to kill the Witch-king with Merry's help; Éowyn subsequently tends to Théoden afterwards and they bid each farewell before Théoden dies in front of his niece. Aragorn then arrives with the Army of the Dead, who overcome Sauron's forces and win the battle. Aragorn frees the Dead Men from their curse.\n\nAragorn decides to march upon the Black Gate as a distraction so Frodo and Sam can reach Mount Doom. Aragorn's army draws out Sauron's remaining forces and empties Mordor, allowing Frodo and Sam to reach the volcano, but Gollum attacks them just as they reach Mount Doom. Sam manages to fend him off, and Frodo enters the volcano. As he stands on the ledge over the volcanic lava, he succumbs to the Ring in front of Sam and claims it as his own, putting it on his finger. Gollum finds the invisible Frodo and attacks him, biting his finger off to reclaim the Ring. Frodo attacks Gollum in an attempt to reclaim the Ring, and in the ensuing struggle they both fall off the ledge. Gollum falls into the lava with the Ring and dies. Frodo clings to the ledge and is rescued by Sam as the Ring disintegrates in the lava. As Frodo and Sam escape, the Eye of Sauron explodes and Mount Doom erupts.\n\nGandalf flies in with eagles to rescue the Hobbits, who awaken in Minas Tirith and are reunited with the surviving Fellowship. Aragorn is crowned King of Gondor and takes Arwen as his queen. The Hobbits return home to the Shire, where Sam marries Rosie Cotton. A few years later, Frodo departs Middle-earth for the Undying Lands with his uncle Bilbo, Gandalf, and the Elves. He leaves Sam the Red Book of Westmarch, which details their adventures. Sam returns to the Shire, where he embraces Rosie and their children.",
  "Pulp Fiction (1994)": "Hitmen Jules Winnfield (Samuel L. Jackson) and Vincent Vega (John Travolta) arrive at an apartment to retrieve a briefcase for their boss, gangster Marsellus Wallace (Ving Rhames), from a business partner, Brett. After Vincent checks the contents of the briefcase, Jules shoots one of Brett's associates, then declaims a passage from the Bible before he and Vincent kill Brett for trying to double-cross Marsellus. They take the briefcase to Marsellus, but they have to wait while he bribes champion boxer Butch Coolidge (Bruce Willis) to take a dive in his upcoming match.\n\nThe next day, Vincent purchases heroin from his drug dealer, Lance. He shoots up and then drives to meet Marsellus's wife Mia (Uma Thurman), having agreed to escort while Marsellus is out of town. They eat at Jack Rabbit Slim's, a 1950s-themed restaurant, and participate in a twist contest, then return home with the trophy. While Vincent is in the bathroom, Mia finds his heroin and snorts it, mistaking it for cocaine. She suffers an overdose; Vincent rushes her to Lance's house, where they revive her with an injection of adrenaline into her heart. Vincent drops Mia off at her home, and the two agree never to tell Marsellus about the incident.\n\nButch bets the bribe money on himself and double-crosses Marsellus, winning the bout but accidentally killing his opponent as well. Knowing that Marsellus will send hitmen after him, he prepares to flee with his girlfriend Fabienne (Maria de Medeiros), but discovers that she has forgotten to pack a gold watch passed down to him through his family. Returning to his apartment to retrieve it, he notices a submachine gun on the kitchen counter and hears the toilet flush. When Vincent exits the bathroom, Butch kills him with it and departs, leaving the gun behind.\n\nWhen Marsellus spots Butch stopped at a traffic light, Butch rams his car into the man, leaving both of them injured and dazed. Once Marsellus regains his senses, he draws a gun and shoots at Butch, chasing him into a pawnshop. As Butch gains the upper hand and is about to shoot Marsellus, the shop owner, Maynard, captures them both at gunpoint and binds and gags them in the basement. Zed, a security guard, soon arrives; he and Maynard take Marsellus into another room and begin to rape him, leaving \"the gimp\" - a silent figure in a bondage suit - to watch over Butch. Butch breaks loose and knocks the gimp unconscious. Instead of fleeing, he decides to save Marsellus and arms himself with a katana from the pawnshop. He kills Maynard and frees Marsellus, who shoots Zed in the crotch with Maynard's shotgun. Marsellus informs Butch that they are even, as long as he tells no one about the rape and departs Los Angeles forever. Butch picks up Fabienne on Zed's chopper, and they drive away.\n\nEarlier, after Vincent and Jules have killed Brett in his apartment, another man bursts out of the bathroom and shoots at them wildly, but misses with every bullet; after briefly checking themselves for wounds, Jules and Vincent shoot him dead. While driving away from the scene through the San Fernando Valley with Brett's associate Marvin, Jules professes that their survival was a miracle, which Vincent disputes. Vincent accidentally shoots Marvin in the head, covering themselves and the car interior in blood in broad daylight. They hide the car at the home of Jules' friend Jimmie, who demands they deal with the problem before his wife Bonnie comes home. Marsellus sends his cleaner, Winston Wolfe (Harvey Keitel), who directs Jules and Vincent to clean the car, hide the body in the trunk, dispose of their bloody clothes, and take the car to a junkyard.\n\nAt a diner, Jules tells Vincent that he plans to retire from his life of crime, convinced that their \"miraculous\" survival at the apartment was a sign of divine intervention. While Vincent is in the bathroom, a couple dubbed \"Pumpkin\" (Tim Roth) and \"Honey Bunny\" (Amanda Plummer) hold up the restaurant and demand Jules' briefcase. Distracting him with its contents, Jules overpowers Pumpkin and holds him at gunpoint; Honey Bunny becomes hysterical and trains her gun on him and Vincent returns with his gun aimed at her, but Jules defuses the situation. He recites the biblical passage, expresses ambivalence about his life of crime, and allows the robbers to take his cash and leave. Jules and Vincent leave the diner with the briefcase in hand.",
  "The Good, the Bad and the Ugly (1966)": "In 1862, during the American Civil War, a mercenary known as \"Angel Eyes\" interrogates former Confederate soldier Stevens, whom Angel Eyes is contracted to kill, about Jackson, a fugitive who stole a cache of Confederate gold. Learning Jackson's new alias \"Bill Carson\", Angel Eyes kills Stevens and the man who hired him, Baker, intending to find the gold himself. Bandit Tuco Ramirez is rescued from bounty hunters by a nameless drifter to whom Tuco refers as \"Blondie\", who delivers him to the local sheriff to collect his $2,000 bounty. As Tuco is about to be hanged, Blondie severs Tuco's noose by shooting it, and sets him free. The two escape on horseback and split the bounty. They repeat the process in other towns until Blondie grows weary of Tuco's complaints and strands him in the desert.\n\nBent on revenge, Tuco catches up with Blondie and force-marches him across the desert until Blondie collapses from dehydration. A runaway horse-drawn hospital ambulance arrives with several dead Confederate soldiers and a near-death Bill Carson, who promises Tuco $200,000 in Confederate gold, buried in a grave in Sad Hill Cemetery in exchange for help. When Tuco returns with water, Carson has died and Blondie, slumped next to him, reveals that Carson recovered and told him the name on the grave before dying. Tuco takes Blondie to a nearby frontier mission to recover.\n\n\nThe iconic Mexican standoff, with Tuco seen on the left, Angel Eyes in the middle, and Blondie on the right: The scene is accompanied by Ennio Morricone's \"The Trio\".\nThe duo decides to search for the gold together, but they are apprehended by Union forces shortly after leaving the mission. Brought to a prison camp, Angel Eyes – revealed to be a Union officer – finds them after Tuco poses as Bill Carson. Tuco reveals the name of the cemetery under torture and is sent away to be killed. Knowing that Blondie would not reveal the location, Angel Eyes recruits him into his search. Tuco escapes his fate by killing Angel Eyes' henchman, and soon finds himself in an evacuated town, where Blondie, Angel Eyes, and his gang have also arrived.\n\nBlondie finds Tuco and the pair kills Angel Eyes' men, though Angel Eyes escapes. They travel toward Sad Hill, but their way is blocked by Union troops on one side of a strategic bridge, with Confederates on the other. Blondie decides to destroy the bridge to disperse the two armies to allow access to the cemetery. As they wire the bridge with explosives, Tuco suggests they share information. Tuco reveals the name of the cemetery, while Blondie says \"Arch Stanton\" is the name on the grave. After the bridge is demolished the armies disperse. Tuco steals a horse and rides to Sad Hill to claim the gold for himself. Tuco finds Arch Stanton's grave and begins digging, where Blondie encourages him at gunpoint to continue. Angel Eyes arrives and holds Blondie at gunpoint. Blondie states that he lied about the name on Stanton's grave, and offers to write the real name of the grave on a rock. Placing it face-down in the courtyard of the cemetery, he challenges Tuco and Angel Eyes to a three-way duel.\n\nThe trio stares each other down. Everyone draws, and Blondie shoots and kills Angel Eyes, while Tuco discovers that his own gun was unloaded by Blondie the night before. Blondie reveals that the gold is actually in the grave beside Arch Stanton's, marked \"Unknown\". Tuco is initially elated to find bags of gold, but Blondie holds him at gunpoint and orders him into a hangman's noose beneath a tree. Blondie binds Tuco's hands and forces him to stand balanced precariously atop an unsteady grave marker while he takes half the gold and rides away. As Tuco screams for mercy, Blondie returns into sight. He severs the rope with a rifle shot, leaving Tuco alive. As Blondie disappears over the horizon, Tuco furiously curses him."
}
