{
  "The Shawshank Redemption (1994)": "In 1947 Portland, Maine, banker Andy Dufresne is convicted of murdering his wife and her lover and is sentenced to two consecutive life sentences at the Shawshank State Penitentiary. He is befriended by Ellis \"Red\" Redding, an inmate and prison contraband smuggler serving a life sentence. Red procures a rock hammer and a large poster of Rita Hayworth for Andy. Assigned to work in the prison laundry, Andy is frequently sexually assaulted by \"the Sisters\" and their leader, Bogs.\n\nIn 1949, Andy overhears the captain of the guards, Byron Hadley, complaining about being taxed on an inheritance and offers to help him shelter the money legally. After an assault by the Sisters nearly kills Andy, Hadley beats and cripples Bogs, who is subsequently transferred to another prison. Andy is not attacked again. Warden Samuel Norton meets Andy and reassigns him to the prison library to assist elderly inmate Brooks Hatlen, a front to allow Andy to manage financial matters for other prison staff, guards from other prisons, and the warden himself. Andy begins writing weekly letters to the state legislature requesting funds to improve the prison's decaying library.\n\nBrooks is paroled in 1954 after serving 50 years, but he cannot adjust to the outside world and eventually hangs himself. The legislature sends a library donation that includes a recording of The Marriage of Figaro; Andy plays an excerpt over the public address system and is punished with solitary confinement. After his release from solitary, Andy explains that hope is what gets him through his time, a concept that Red dismisses. In 1963, Norton begins exploiting prison labor for public works, profiting by undercutting skilled labor costs and receiving bribes. Andy launders the money using the alias \"Randall Stephens\".\n\nTommy Williams is incarcerated for burglary in 1965. Andy and Red befriend him, and Andy helps him pass his GED exam. A year later, Tommy reveals to Red and Andy that his cellmate at another prison had claimed responsibility for the murders for which Andy was convicted. Andy approaches Norton with this information, but Norton refuses to listen, and when Andy mentions the money laundering, Norton sends him back to solitary confinement. Norton has Hadley murder Tommy under the guise of an escape attempt. Andy attempts to discontinue the laundering, but relents after Norton threatens to destroy the library, remove Andy's protection from the guards, and move him to worse conditions. Andy is released from solitary confinement after two months, and he tells a skeptical Red that he dreams of living in Zihuatanejo, a Mexican coastal town. Andy also tells him of a specific hayfield near Buxton, asking Red—once he is released—to retrieve a package that Andy buried there. Red worries about Andy's well-being, especially when he learns Andy asked a fellow inmate for 6 ft (1.8 m) of rope.\n\nAt the next day's roll call, the guards find Andy's cell empty. An irate Norton throws a rock at a poster of Raquel Welch hanging on the cell wall, revealing a tunnel that Andy dug with his rock hammer over the past 19 years. The previous night, Andy used the rope to escape through the tunnel and prison sewage pipe, taking Norton's suit, shoes, and ledger, containing proof of the money laundering. While guards search for him, Andy poses as Randall Stephens, withdraws over $370,000 (equivalent to $2.92 million in 2019) of the laundered money from several banks, and mails the ledger and other evidence of the corruption and murders at Shawshank to a local newspaper. State police arrive at Shawshank and take Hadley into custody, while Norton commits suicide to avoid arrest.\n\nThe following year, Red is finally paroled after serving 40 years. He struggles to adapt to life outside prison and fears that he never will. Remembering his promise to Andy, he visits Buxton and finds a cache containing money and a letter asking him to come to Zihuatanejo. Red violates his parole by traveling to Fort Hancock, Texas, and crossing the border into Mexico, admitting that he finally feels hope. He finds Andy on a beach in Zihuatanejo, and the two reunited friends happily embrace.",
  "The Godfather (1972)": "In 1945 New York City, at his daughter Connie's wedding to Carlo, Vito Corleone, the don of the Corleone crime family listens to requests. His youngest son, Michael, who was a Marine during World War II, introduces his girlfriend, Kay Adams, to his family at the reception. Johnny Fontane, a popular singer and Vito's godson, seeks Vito's help in securing a movie role; Vito dispatches his consigliere, Tom Hagen, to Los Angeles to persuade studio head Jack Woltz to give Johnny the part. Woltz refuses until he wakes up in bed with the severed head of his prized stallion.\n\nShortly before Christmas, drug baron Sollozzo, backed by the Tattaglia crime family, asks Vito for investment in his narcotics business and protection through his political connections. Wary of involvement in a dangerous new trade that risks alienating political insiders, Vito declines. Suspicious, Vito sends his enforcer, Luca Brasi, to spy on them. Brasi is garroted to death during his first meeting with Bruno Tattaglia and Sollozzo. Later, Sollozzo kidnaps Hagen, then has Vito gunned down in the street. Vito's eldest son Sonny takes command, Sollozzo pressures Hagen to persuade Sonny to accept Sollozzo's deal, then releases him. The family receives fish wrapped in Brasi's bullet-proof vest, indicating that Luca \"sleeps with the fishes\". Vito survives, and at the hospital, Michael thwarts another attempt on his father. Michael's jaw is broken by NYPD Capt. McCluskey, Sollozzo's unofficial bodyguard. Sonny retaliates with a hit on Tattaglia's son. The Corleones plot to murder Sollozzo and McCluskey; feigning a desire to settle the dispute, Michael meets them in a Bronx restaurant in which, after retrieving a handgun planted by Peter Clemenza, a Corleone capo, he kills both men.\n\nDespite a clampdown by the authorities, war breaks out between the Five Families and Vito fears for his family. Michael takes refuge in Sicily and his elder brother Fredo is sheltered by Moe Greene in Las Vegas. Sonny attacks Carlo on the street for abusing Connie and threatens to kill him if it happens again. When it does, Sonny speeds to their home but is ambushed at a highway toll booth and violently murdered by rival gangsters wielding submachine guns. While in Sicily, Michael meets and marries Apollonia, but a car bomb intended for him takes her life.\n\nDevastated by Sonny's death and realizing that the Tattaglias are controlled by the now-dominant don, Barzini, Vito attempts to end the feud. He assures the Five Families that he will withdraw his opposition to their heroin business and forgo avenging Sonny's murder. His safety guaranteed, Michael returns home to enter the family business and marry Kay, promising her that the business will be legitimate within five years. Kay gives birth to two children by the early 1950s. With his father nearing the end of his life and Fredo too weak, Michael takes the family reins, starting to move the family's business to Las Vegas. Expecting trouble due to this move, he insists Hagen also relocate to Las Vegas but relinquish his role to Vito because Hagen is not a \"wartime consigliere\". Vito agrees Hagen should \"have no part in what will happen\" in the coming battles with the rival families. When Michael travels to Las Vegas to buy out Greene's stake in the family's casinos, he is dismayed to see that Fredo is more loyal to Greene than to his own family.\n\nIn 1955, after warning Michael that whoever agrees to arrange a meeting between him and Barzini is a traitor, Vito suffers a fatal heart attack. At the funeral, Tessio, a Corleone capo, asks Michael to meet with Barzini, with the meeting set for the same day as the baptism of Connie's baby. While Michael stands at the altar as the child's godfather, Corleone hitmen murder the other New York City dons and Greene. Tessio's treachery leads to his execution. Michael extracts Carlo's confession to his complicity in setting up Sonny's murder for Barzini; Clemenza garrotes Carlo to death. Connie accuses Michael of the murder, telling Kay that Michael ordered all of the killings. Kay is at first relieved when Michael denies it, but later dismayed when she watches the capos arrive to pay reverence to her husband as Don Corleone and their closing the door on her.",
  "The Godfather Part II (1974)": "The film intercuts between events some time after The Godfather and the early life of Vito Corleone.\n\nIn 1901, the family of nine-year-old Vito Andolini is killed in Corleone, Sicily, after his father insults local Mafia chieftain Don Ciccio. Vito escapes on a ship to New York City, and is registered as \"Vito Corleone\" on Ellis Island. In 1917, having settled in New York, he marries and has a son, whom he names Santino (\"Sonny\"), with his wife. He loses his job due to the interference of a local don, Fanucci; Clemenza invites Vito to take part in a burglary unwittingly.\n\nVito has two more sons, Fredo and Michael. Vito's criminal conduct attracts the attention of Fanucci, who extorts him. Vito's partners, Clemenza and Salvatore Tessio, suggest paying him, but Vito insists Fanucci will accept a smaller payment if they make him \"an offer he don't refuse\". During a neighborhood festa, he stalks Fanucci to his apartment and shoots him dead. Vito becomes a respected and successful member of the community and is approached for help by a widow who is being evicted. After the widow's landlord learns of Vito's reputation, he agrees to let the widow stay on very favorable terms. Vito, along with his family, visits Sicily for the first time since emigrating. He and business partner Tommasino are admitted to Don Ciccio's compound, ostensibly to ask for Ciccio's blessing on their olive oil business. Vito exacts vengeance, killing Ciccio after revealing his former identity.\n\nIn the 1940s, the Corleone family gathers in their dining room to surprise Vito for his birthday. Michael announces that, in response to the attack on Pearl Harbor, he has left college and enlisted in the United States Marine Corps, leaving Sonny furious, Tom incredulous, and Fredo the only supportive brother. When Vito is heard at the door, all but Michael leave the room to greet him.\n\nIn 1958, during his son's First Communion party at Lake Tahoe, Michael has a series of meetings in his role as the don of the Corleone crime family. Frank Pentangeli, a Corleone capo, is dismayed that Michael refuses to help defend his territory against the Rosato brothers, who work for Hyman Roth, a long-standing Corleone business partner. That night, Michael leaves Nevada after surviving an assassination attempt at his home.\n\nMichael suspects Roth planned the assassination, but feigns ignorance when they meet. In New York City, Pentangeli attempts to maintain Michael's pretense by making peace with the Rosato family but they try to kill him. Roth, Michael, and several of their partners travel to Havana to discuss their future Cuban business prospects under the cooperative government of Fulgencio Batista. Michael becomes reluctant after reconsidering the viability of the ongoing Cuban Revolution. On New Year's Eve, Fredo inadvertently reveals that he knows Roth's right-hand man, Johnny Ola, having previously claimed that they had never met, and Michael realizes that it was Fredo who had betrayed him. Michael orders his bodyguard to kill Ola and Roth, but the bodyguard is killed by the police as he is attempting to assassinate Roth with a pillow in his hospital bed. Batista abdicates due to rebel advances. During the ensuing chaos, Michael, Fredo, and Roth separately escape to the United States. Back home, Michael learns that his wife Kay has miscarried.\n\nIn Washington, D.C., a Senate committee on organized crime is investigating the Corleone family. Pentangeli agrees to testify against Michael, who he believes had double-crossed him, and is placed under witness protection. On returning to Nevada, Fredo tells Michael that he felt resentful for being disregarded. He claims to be ignorant of the plot on Michael's life and informs Michael that the Senate lawyer is on Roth's payroll. Michael disowns Fredo but orders a capo to continue protecting him while their mother is alive. Michael sends for Pentangeli's brother from Sicily, resulting in Pentangeli renouncing his previous statement; the hearing dissolves in an uproar. Kay reveals to Michael that she actually had an abortion, not a miscarriage and that she intends to remove their children from Michael's criminal life. Outraged, Michael strikes Kay, banishes her from the family, and takes custody of the children.\n\nMichael's mother dies and Michael moves to wrap up loose ends. Roth is forced to return to the United States after being refused asylum and entry to Israel. Michael orders capo Rocco Lampone to assassinate Roth, who shoots Roth dead at Miami International Airport. At the witness protection compound, consigliere Tom Hagen reminds Pentangeli that failed plotters against the Roman Emperor often committed suicide, in return for clemency for their families, and assures him that his family will be cared for, as long as he agrees to do this. Pentangeli slits his wrists in his bathtub. Al Neri, acting on Michael's orders, kills Fredo.",
  "The Dark Knight (2008)": "A gang of criminals robs a Gotham City mob bank, murdering each other for a higher share until only the Joker remains; he escapes with the money. Batman, District Attorney Harvey Dent and Lieutenant Jim Gordon form an alliance to rid Gotham of organized crime. Bruce Wayne is impressed with Dent's idealism and offers to support his career; he believes that, with Dent as Gotham's protector, he can give up being Batman and lead a normal life with Rachel Dawes—even though she and Dent are dating.\n\nMob bosses Sal Maroni, Gambol, and the Chechen hold a videoconference with their corrupt accountant, Lau, who has hidden their funds for safekeeping and fled to Hong Kong. The meeting is interrupted by the Joker, who warns them that Batman is unhindered by the law, and offers to kill him in exchange for half of their money. After Joker kills Gambol and takes over his gang, the mob ultimately decides to accept the offer.\n\nBatman finds Lau in Hong Kong and brings him back to Gotham to testify, allowing Dent to apprehend the entire mob. The Joker threatens a string of murders unless Batman reveals his identity, and starts by killing Police Commissioner Gillian B. Loeb and Judge Surillo, who is presiding over the mob trial. The Joker also targets Mayor Anthony Garcia, but Gordon sacrifices himself to stop the assassination. Dent learns that Rachel is the next target.\n\nBruce decides to reveal his identity. Before he can, however, Dent announces that he is Batman. Dent is taken into protective custody, but the Joker appears and attacks the convoy. Batman comes to Dent's rescue and Gordon, who faked his death, apprehends the Joker, securing a promotion to Commissioner. Rachel and Dent are escorted away by detectives on Maroni's payroll; Gordon later learns that they never arrived home. Batman interrogates the Joker, who reveals that they have been trapped in separate locations rigged with explosives. Batman races to save Rachel, while Gordon attempts to rescue Dent. Batman arrives at the site but realizes that the Joker sent him to Dent's location instead. Both buildings explode, killing Rachel and disfiguring half of Dent's face. The Joker escapes with Lau, whom he later kills along with the Chechen.\n\nColeman Reese, an accountant at Wayne Enterprises, deduces that Bruce is Batman and tries to go public with the information. Not wanting Reese's revelation to interfere with his plans, the Joker threatens to destroy a hospital unless someone kills Reese within the hour. Gordon orders the evacuation of all hospitals in Gotham and goes to secure Reese. The Joker gives Dent a gun and convinces him to seek revenge for Rachel's death, then destroys the hospital and escapes with a busload of hostages. Dent goes on a killing spree, as the vigilante Two-Face, deciding the fates of people he holds responsible for Rachel's death by flipping his lucky coin—one side having been scorched in the explosion.\n\nAfter announcing Gotham will be subject to his rule come nightfall, the Joker rigs two evacuating ferries with explosives, one containing civilians and the other containing prisoners. He threatens to blow them both up by midnight, but will let one ferry live if its passengers (who have been supplied the detonator to the other boat's explosives) blow up the other. Batman finds the Joker by exploiting the sonar capabilities of all phones in the city, with the reluctant help of Lucius Fox. Both the civilians and the prisoners refuse to kill each other, while Batman apprehends the Joker after a brief fight. Before the SWAT arrive to take the Joker into custody, he gloats that Gotham's citizens will lose hope once Dent's rampage becomes public knowledge.\n\nGordon and Batman arrive at the building where Rachel perished, and encounter Two-Face, who has kept Gordon's family as hostages. Two-Face shoots Batman, and threatens to kill Gordon's son, claiming that Gordon's negligence is responsible for Rachel's death. Before he flips his coin for the boy, Batman, who was wearing body armor, tackles Two-Face off the building to his death. Batman persuades Gordon to hold him responsible for the killing spree and preserve Dent's heroic image. Dent is hailed as a hero and the police launch a manhunt for Batman. Gordon destroys the Bat-signal, Fox watches as the sonar device self-destructs, and Alfred Pennyworth burns a letter from Rachel saying she planned to marry Dent.",
  "12 Angry Men (1957)": "In the overheated jury room of the New York County Courthouse, a jury prepares to deliberate the case of an 18-year-old impoverished youth accused of stabbing his father to death. The judge instructs them that if there is any reasonable doubt, the jurors are to return a verdict of not guilty; if found guilty, the defendant will receive a death sentence. The verdict must be unanimous.\n\nAt first, the evidence seems convincing: a neighbor testified to witnessing the defendant stab his father from her window. Another neighbor testified that he heard the defendant threaten to kill his father and the father's body hitting the ground, and then, through his peephole, saw the defendant run past his door. The boy has a violent past and had recently purchased a switchblade of the same type as was found at the murder scene, but claimed he lost it. The knife at the scene had been cleaned of fingerprints.\n\nThe jurors at first seem to take the decision lightly. Juror 7 in particular is anxious to catch his tickets to the baseball game. In a preliminary vote conducted by Juror 1, all jurors vote guilty except Juror 8, who believes that there should be some discussion before the verdict is made. He questions the reliability of the witnesses’ testimonies and also throws doubt on the supposed uniqueness of the murder weapon by producing an identical switchblade from his pocket. He says he cannot vote guilty because reasonable doubt exists. With his arguments seemingly failing to convince any of the other jurors, Juror 8 suggests a secret ballot, from which he will abstain; if all the other jurors still vote guilty, he will acquiesce. The ballot reveals one not guilty vote. Juror 3 immediately accuses Juror 5 (who previously said they grew up in the slums like the defendant). As the two bicker, Juror 9 reveals that he changed his vote, respecting Juror 8's motives and agreeing there should be more discussion.\n\nJuror 8 argues that the noise of a passing train would have obscured the threat the second witness claimed to have overheard. Juror 5 changes his vote, as does Juror 11, who believes the defendant, had he truly killed his father, would not have returned to the crime scene several hours later to retrieve the murder weapon as it had already been cleaned of fingerprints. Juror 8 points out that people often say \"I'm going to kill you\" without literally meaning it.\n\nJurors 5, 6, and 8 further question the second witness's story. Juror 3 is infuriated, and after a verbal argument, tries to attack Juror 8, shouting \"I'll kill him!\", proving Juror 8's point about the defendant's words. Jurors 2 and 6 change their votes; the jury is now evenly split.\n\nJuror 4 doubts the defendant's alibi, based on the boy's inability to recall certain details regarding his alibi. Juror 8 tests Juror 4's own memory. He is able to remember events from the previous week, with difficulty similar to the defendant. Jurors 2, 3, and 8 debate whether the defendant could have stabbed his much-taller father from a downward angle, eventually deciding it was physically possible, though awkward. Juror 5 points out that someone who knew how to use a switchblade would have instead stabbed underhand at an upwards angle.\n\nJuror 7 half-heartedly changes his vote, leading to an inquisition by Juror 11. Under duress Juror 7 sloppily says he thinks the boy is not guilty. After another vote, Jurors 12 and 1 also change their votes, leaving only three guilty votes. Juror 10 erupts in vitriol regarding the defendant's ethnicity. The rest of the jurors, except Juror 4, stand up to turn their backs to him. When he bemoans that nobody is listening to him, Juror 4 states that he has, and tells him to sit down and be quiet. Juror 10 then walks over to a desk in the corner, now isolated. Juror 8 makes a statement about reasonable doubt before having the rest of the jurors return to the case. Juror 4 declares that the woman who saw the killing from across the street stands as solid evidence. Juror 12 reverts to a guilty vote.\n\nAfter watching Juror 4 rub his nose, irritated by impressions from his eyeglasses, Juror 9 realizes that the first witness had the same impressions on her nose as well, indicating that she wore eyeglasses as well but did not wear them to court. The other jurors begin to chime in about this new breakthrough. Juror 8 reasons that the witness, who was trying to sleep when she saw the killing, was not wearing her eyeglasses when it happened and she would not have had time to put them on to get a clear view of the person who did the stabbing, making her story dubious. Juror 8 goes around the room to question Jurors 12, 10 & 4 (in that order) about changing their vote. The remaining jurors, except Juror 3, change their vote to not guilty.\n\nJuror 3 gives an increasingly tortured string of arguments, building on earlier remarks about his strained relationship with his own son. In a moment of rage, Juror 3 tears up a photograph of him and his son before breaking down sobbing. He mutters not guilty, making the vote unanimous. As the others leave, Juror 8 helps the distraught Juror 3 with his coat. The defendant is found not guilty off-screen and the jurors leave the courthouse. In a brief epilogue, Jurors 8 (Davis) and 9 (McCardle) introduce each other for the first time by their names before parting.",
  "Schindler's List (1993)": "In Kraków during World War II, the Germans force local Polish Jews into the overcrowded Kraków Ghetto. Oskar Schindler, an ethnic German from Czechoslovakia, arrives in the city hoping to make his fortune. A member of the Nazi Party, Schindler bribes Wehrmacht (German armed forces) and SS officials and acquires a factory to produce enamelware. To help him run the business, Schindler enlists the aid of Itzhak Stern, a Jewish official who has contacts with black marketeers and the Jewish business community. Stern helps Schindler arrange financing for the factory. Schindler maintains friendly relations with the Nazis and enjoys wealth and status as \"Herr Direktor\", and Stern handles administration. Schindler hires Jewish workers because they cost less, while Stern ensures that as many people as possible are deemed essential to the German war effort, which saves them from being transported to concentration camps or killed.\n\nSS-Untersturmführer (second lieutenant) Amon Göth arrives in Kraków to oversee construction of Płaszów concentration camp. When the camp is completed, he orders the ghetto liquidated; many people are killed in the process. Schindler witnesses the massacre and is profoundly affected. He particularly notices a young girl in a red coat as she hides from the Nazis, and later sees her body among a wagonload of corpses. Schindler is careful to maintain his friendship with Göth and, through bribery, continues to enjoy SS support. Göth brutalizes his Jewish maid Helen Hirsch and randomly shoots people from the balcony of his villa; the prisoners are in constant fear for their lives. As time passes, Schindler's focus shifts from making money to trying to save as many lives as possible. To better protect his workers, Schindler bribes Göth into allowing him to build a sub-camp.\n\nAs the Germans begin losing the war, Göth is ordered to ship the remaining Jews at Płaszów to Auschwitz concentration camp. Schindler asks Göth to allow him to move his workers to a munitions factory he plans to build in Brünnlitz near his home town Zwittau. Göth agrees, but charges a huge bribe. Schindler and Stern create \"Schindler's List\" – a list of 850 people to be transferred to Brünnlitz instead of Auschwitz.\n\nAs the Jewish workers are transported by train to Brünnlitz, the one carrying the women and girls is accidentally redirected to Auschwitz-Birkenau; Schindler bribes Rudolf Höss, the commandant of Auschwitz, to win their release. At the new factory, Schindler forbids the SS guards from entering the factory floor without permission and encourages the Jews to observe the Jewish Sabbath. Over the next seven months, he spends much of his fortune bribing Nazi officials and buying shell casings from other companies; due to Schindler's machinations, the factory does not produce any usable armaments. Schindler runs out of money in 1945, just as Germany surrenders.\n\nAs a Nazi Party member and war profiteer, Schindler must flee the advancing Red Army to avoid capture. The SS guards in Schindler's factory have been ordered to kill the Jewish workforce, but Schindler persuades them to \"return to [their] families as men, instead of murderers\". He bids farewell to his workers and prepares to head west, hoping to surrender to the Americans. The workers give Schindler a signed statement attesting to his role in saving Jewish lives and present him with a ring engraved with a Talmudic quotation: \"Whoever saves one life saves the world entire\". Schindler is touched but also ashamed, as he feels he should have done more. The workers comfort Schindler and they exchange tearful farewells before he and his wife leave. When the Schindlerjuden awaken the next morning, a Soviet soldier announces that they have been liberated. The Jews walk to a nearby town.\n\nAn epilogue reveals that Schindler's marriage failed after the war, as did his attempts to start new businesses, while Göth was executed for crimes against humanity. Schindler was later honored by Yad Vashem for his efforts to save his workers from being killed. In the present, many of the surviving Schindlerjuden and the actors portraying them visit Schindler's grave and place stones on its marker (the traditional Jewish sign of respect on visiting a grave), with Liam Neeson laying two roses.",
  "The Lord of the Rings: The Return of the King (2003)": "Two Hobbits, Sméagol and his cousin, Déagol, are fishing when Déagol discovers the One Ring in the river. Sméagol's mind is ensnared by the Ring, and he kills his cousin for it. He retreats into the Misty Mountains as the Ring twists his body and mind until he becomes the creature Gollum.\n\nCenturies later, during the War of the Ring, Gandalf leads Aragorn, Legolas, Gimli, and King Théoden to Isengard, where they reunite with Merry and Pippin. Gandalf retrieves Saruman's palantír, and the group returns to Edoras to celebrate their victory at Helm's Deep. That night, Pippin looks into the palantír and is seen by Sauron. From Pippin's description of his visions, Gandalf surmises that Sauron will attack Gondor's capital Minas Tirith. He rides there to warn Gondor's steward Denethor, taking Pippin with him.\n\nGollum leads Frodo Baggins and Samwise Gamgee to Minas Morgul, where they watch the Witch-king of Angmar, leader of the nine Nazgûl, lead an army of Orcs towards Gondor. The hobbits begin climbing a stair carved in the cliff face that leads to a secret tunnel into Mordor, unaware that Gollum plans to kill them and take the Ring. The Witch-king and his forces strike and overwhelm Osgiliath, forcing Faramir and his garrison to retreat to Minas Tirith.\n\nGollum disposes of the Hobbits' food, blaming Sam. Believing that Sam desires the Ring, Frodo tells him to go home before he and Gollum continue to the tunnel leading to Mordor. Gollum tricks him into venturing into the lair of the giant spider Shelob. Frodo narrowly escapes and confronts Gollum, telling him that he must destroy the Ring for both their sakes. Gollum attacks Frodo but falls down a chasm. Frodo continues on, but Shelob discovers, paralyses, and binds him. Sam returns and wounds Shelob, driving her away, but then hides as Orcs appear and take Frodo with them. The Orcs prepare to execute Frodo, but they end up fighting each other over ownership of Frodo's mithril vest; the distraction allows Sam to rescue Frodo, and they escape before going on to continue their journey.\n\nAs King Théoden gathers the Rohirrim army, Aragorn learns from Elrond that Arwen is dying, having refused to leave Middle-Earth to be with Aragorn after seeing a vision of their future son. Elrond gives Aragorn Andúril, reforged from the shards of King Elendil's sword Narsil, so that Aragorn can reclaim his birthright and gain reinforcements from the ghostly Dead Men of Dunharrow. Joined by Legolas and Gimli, Aragorn travels to the Dead Men's lair, pledging to release them from Isildur's undead curse should they come to Gondor's aid.\n\nFaramir is gravely wounded after a futile effort to recapture Osgiliath; believing his son to be dead, Denethor falls into madness. Gandalf is left to defend the city against the Orc army, led by Gothmog. As Gothmog's army forces its way into the city, Denethor attempts to kill himself and Faramir on a pyre. Pippin alerts Gandalf and they save Faramir, but a burning Denethor leaps to his death from the top of Minas Tirith just before Théoden and his nephew, Éomer, arrive with the Rohirrim. During the ensuing battle, they are overwhelmed by the Oliphaunt-riding Haradrim and the Witch-King mortally wounds Théoden. Just as the Witch-king prepares to finish Théoden off, his niece Éowyn battles and manages to kill the Witch-king with Merry's help; Éowyn subsequently tends to Théoden afterwards and they bid each farewell before Théoden dies in front of his niece. Aragorn then arrives with the Army of the Dead, who overcome Sauron's forces and win the battle. Aragorn frees the Dead Men from their curse.\n\nAragorn decides to march upon the Black Gate as a distraction so Frodo and Sam can reach Mount Doom. Aragorn's army draws out Sauron's remaining forces and empties Mordor, allowing Frodo and Sam to reach the volcano, but Gollum attacks them just as they reach Mount Doom. Sam manages to fend him off, and Frodo enters the volcano. As he stands on the ledge over the volcanic lava, he succumbs to the Ring in front of Sam and claims it as his own, putting it on his finger. Gollum finds the invisible Frodo and attacks him, biting his finger off to reclaim the Ring. Frodo attacks Gollum in an attempt to reclaim the Ring, and in the ensuing struggle they both fall off the ledge. Gollum falls into the lava with the Ring and dies. Frodo clings to the ledge and is rescued by Sam as the Ring disintegrates in the lava. As Frodo and Sam escape, the Eye of Sauron explodes and Mount Doom erupts.\n\nGandalf flies in with eagles to rescue the Hobbits, who awaken in Minas Tirith and are reunited with the surviving Fellowship. Aragorn is crowned King of Gondor and takes Arwen as his queen. The Hobbits return home to the Shire, where Sam marries Rosie Cotton. A few years later, Frodo departs Middle-earth for the Undying Lands with his uncle Bilbo, Gandalf, and the Elves. He leaves Sam the Red Book of Westmarch, which details their adventures. Sam returns to the Shire, where he embraces Rosie and their children.",
  "Pulp Fiction (1994)": "Hitmen Jules Winnfield (Samuel L. Jackson) and Vincent Vega (John Travolta) arrive at an apartment to retrieve a briefcase for their boss, gangster Marsellus Wallace (Ving Rhames), from a business partner, Brett. After Vincent checks the contents of the briefcase, Jules shoots one of Brett's associates, then declaims a passage from the Bible before he and Vincent kill Brett for trying to double-cross Marsellus. They take the briefcase to Marsellus, but they have to wait while he bribes champion boxer Butch Coolidge (Bruce Willis) to take a dive in his upcoming match.\n\nThe next day, Vincent purchases heroin from his drug dealer, Lance. He shoots up and then drives to meet Marsellus's wife Mia (Uma Thurman), having agreed to escort while Marsellus is out of town. They eat at Jack Rabbit Slim's, a 1950s-themed restaurant, and participate in a twist contest, then return home with the trophy. While Vincent is in the bathroom, Mia finds his heroin and snorts it, mistaking it for cocaine. She suffers an overdose; Vincent rushes her to Lance's house, where they revive her with an injection of adrenaline into her heart. Vincent drops Mia off at her home, and the two agree never to tell Marsellus about the incident.\n\nButch bets the bribe money on himself and double-crosses Marsellus, winning the bout but accidentally killing his opponent as well. Knowing that Marsellus will send hitmen after him, he prepares to flee with his girlfriend Fabienne (Maria de Medeiros), but discovers that she has forgotten to pack a gold watch passed down to him through his family. Returning to his apartment to retrieve it, he notices a submachine gun on the kitchen counter and hears the toilet flush. When Vincent exits the bathroom, Butch kills him with it and departs, leaving the gun behind.\n\nWhen Marsellus spots Butch stopped at a traffic light, Butch rams his car into the man, leaving both of them injured and dazed. Once Marsellus regains his senses, he draws a gun and shoots at Butch, chasing him into a pawnshop. As Butch gains the upper hand and is about to shoot Marsellus, the shop owner, Maynard, captures them both at gunpoint and binds and gags them in the basement. Zed, a security guard, soon arrives; he and Maynard take Marsellus into another room and begin to rape him, leaving \"the gimp\" - a silent figure in a bondage suit - to watch over Butch. Butch breaks loose and knocks the gimp unconscious. Instead of fleeing, he decides to save Marsellus and arms himself with a katana from the pawnshop. He kills Maynard and frees Marsellus, who shoots Zed in the crotch with Maynard's shotgun. Marsellus informs Butch that they are even, as long as he tells no one about the rape and departs Los Angeles forever. Butch picks up Fabienne on Zed's chopper, and they drive away.\n\nEarlier, after Vincent and Jules have killed Brett in his apartment, another man bursts out of the bathroom and shoots at them wildly, but misses with every bullet; after briefly checking themselves for wounds, Jules and Vincent shoot him dead. While driving away from the scene through the San Fernando Valley with Brett's associate Marvin, Jules professes that their survival was a miracle, which Vincent disputes. Vincent accidentally shoots Marvin in the head, covering themselves and the car interior in blood in broad daylight. They hide the car at the home of Jules' friend Jimmie, who demands they deal with the problem before his wife Bonnie comes home. Marsellus sends his cleaner, Winston Wolfe (Harvey Keitel), who directs Jules and Vincent to clean the car, hide the body in the trunk, dispose of their bloody clothes, and take the car to a junkyard.\n\nAt a diner, Jules tells Vincent that he plans to retire from his life of crime, convinced that their \"miraculous\" survival at the apartment was a sign of divine intervention. While Vincent is in the bathroom, a couple dubbed \"Pumpkin\" (Tim Roth) and \"Honey Bunny\" (Amanda Plummer) hold up the restaurant and demand Jules' briefcase. Distracting him with its contents, Jules overpowers Pumpkin and holds him at gunpoint; Honey Bunny becomes hysterical and trains her gun on him and Vincent returns with his gun aimed at her, but Jules defuses the situation. He recites the biblical passage, expresses ambivalence about his life of crime, and allows the robbers to take his cash and leave. Jules and Vincent leave the diner with the briefcase in hand.",
  "The Good, the Bad and the Ugly (1966)": "In 1862, during the American Civil War, a mercenary known as \"Angel Eyes\" interrogates former Confederate soldier Stevens, whom Angel Eyes is contracted to kill, about Jackson, a fugitive who stole a cache of Confederate gold. Learning Jackson's new alias \"Bill Carson\", Angel Eyes kills Stevens and the man who hired him, Baker, intending to find the gold himself. Bandit Tuco Ramirez is rescued from bounty hunters by a nameless drifter to whom Tuco refers as \"Blondie\", who delivers him to the local sheriff to collect his $2,000 bounty. As Tuco is about to be hanged, Blondie severs Tuco's noose by shooting it, and sets him free. The two escape on horseback and split the bounty. They repeat the process in other towns until Blondie grows weary of Tuco's complaints and strands him in the desert.\n\nBent on revenge, Tuco catches up with Blondie and force-marches him across the desert until Blondie collapses from dehydration. A runaway horse-drawn hospital ambulance arrives with several dead Confederate soldiers and a near-death Bill Carson, who promises Tuco $200,000 in Confederate gold, buried in a grave in Sad Hill Cemetery in exchange for help. When Tuco returns with water, Carson has died and Blondie, slumped next to him, reveals that Carson recovered and told him the name on the grave before dying. Tuco takes Blondie to a nearby frontier mission to recover.\n\n\nThe iconic Mexican standoff, with Tuco seen on the left, Angel Eyes in the middle, and Blondie on the right: The scene is accompanied by Ennio Morricone's \"The Trio\".\nThe duo decides to search for the gold together, but they are apprehended by Union forces shortly after leaving the mission. Brought to a prison camp, Angel Eyes – revealed to be a Union officer – finds them after Tuco poses as Bill Carson. Tuco reveals the name of the cemetery under torture and is sent away to be killed. Knowing that Blondie would not reveal the location, Angel Eyes recruits him into his search. Tuco escapes his fate by killing Angel Eyes' henchman, and soon finds himself in an evacuated town, where Blondie, Angel Eyes, and his gang have also arrived.\n\nBlondie finds Tuco and the pair kills Angel Eyes' men, though Angel Eyes escapes. They travel toward Sad Hill, but their way is blocked by Union troops on one side of a strategic bridge, with Confederates on the other. Blondie decides to destroy the bridge to disperse the two armies to allow access to the cemetery. As they wire the bridge with explosives, Tuco suggests they share information. Tuco reveals the name of the cemetery, while Blondie says \"Arch Stanton\" is the name on the grave. After the bridge is demolished the armies disperse. Tuco steals a horse and rides to Sad Hill to claim the gold for himself. Tuco finds Arch Stanton's grave and begins digging, where Blondie encourages him at gunpoint to continue. Angel Eyes arrives and holds Blondie at gunpoint. Blondie states that he lied about the name on Stanton's grave, and offers to write the real name of the grave on a rock. Placing it face-down in the courtyard of the cemetery, he challenges Tuco and Angel Eyes to a three-way duel.\n\nThe trio stares each other down. Everyone draws, and Blondie shoots and kills Angel Eyes, while Tuco discovers that his own gun was unloaded by Blondie the night before. Blondie reveals that the gold is actually in the grave beside Arch Stanton's, marked \"Unknown\". Tuco is initially elated to find bags of gold, but Blondie holds him at gunpoint and orders him into a hangman's noose beneath a tree. Blondie binds Tuco's hands and forces him to stand balanced precariously atop an unsteady grave marker while he takes half the gold and rides away. As Tuco screams for mercy, Blondie returns into sight. He severs the rope with a rifle shot, leaving Tuco alive. As Blondie disappears over the horizon, Tuco furiously curses him.",
  "The Lord of the Rings: The Fellowship of the Ring (2001)": "In the Second Age of Middle-earth, the lords of Elves, Dwarves, and Men are given Rings of Power. Unbeknownst to them, the Dark Lord Sauron forges the One Ring in Mount Doom, instilling into it a great part of his power, in order to dominate the other Rings so he might conquer Middle-earth. A final alliance of Men and Elves battles Sauron's forces in Mordor. Isildur of Gondor severs Sauron's finger and the Ring with it, thereby vanquishing Sauron and returning him to spirit form. With Sauron's first defeat, the Third Age of Middle-earth begins. The Ring's influence corrupts Isildur, who takes it for himself. Isildur is later killed by Orcs and the Ring is lost in a river for 2,500 years until it is found by Gollum, who owns it for five centuries. The Ring is then found by a hobbit named Bilbo Baggins, who is unaware of its history.\n\nSixty years later, Bilbo celebrates his 111th birthday in the Shire, reuniting with his old friend, the wizard Gandalf the Grey. Bilbo reveals that he intends to leave the Shire for one last adventure, and he leaves his inheritance, including the Ring, to his nephew Frodo. Gandalf investigates the Ring, discovers its true nature, and learns that Gollum was captured and tortured by Sauron's Orcs, revealing two words during his interrogation: \"Shire\" and \"Baggins.\" Gandalf returns and warns Frodo to leave the Shire. As Frodo departs with his friend, gardener Samwise Gamgee, Gandalf rides to Isengard to meet with the wizard Saruman, but learns that he has joined forces with Sauron, who has dispatched his nine undead Nazgûl servants to find Frodo.\n\nFrodo and Sam are joined by fellow hobbits Merry and Pippin, and they evade the Nazgûl before arriving in Bree, where they are meant to meet Gandalf. However, Gandalf never arrives, having been taken prisoner by Saruman. The hobbits are then aided by a Ranger named Strider, who promises to escort them to Rivendell; however, they are ambushed by the Nazgûl on Weathertop, and their leader, the Witch-King, stabs Frodo with a Morgul blade. Arwen, an Elf and Strider's beloved, locates Strider and rescues Frodo, summoning flood-waters that sweep the Nazgûl away. She takes him to Rivendell, where he is healed by the Elves. Frodo meets with Gandalf, who escaped Isengard with help from a Great Eagle. That night, Strider reunites with Arwen, and they affirm their love for each other.\n\nFacing the threat of both Sauron and Saruman, Arwen's father, Lord Elrond, decides against keeping the Ring in Rivendell for long. He holds a council of Elves, Men, and Dwarves, also attended by Frodo and Gandalf, that decides the Ring must be destroyed in the fires of Mount Doom. Frodo volunteers to take the Ring, accompanied by Gandalf, Sam, Merry, Pippin, Elf Legolas, Dwarf Gimli, Boromir of Gondor, and Strider—-who is in fact Aragorn, Isildur's heir and the rightful King of Gondor. Bilbo, now living in Rivendell, gives Frodo his sword, Sting.\n\nThe Fellowship of the Ring sets off over the mountain Caradhras, but Saruman summons a storm that forces them to travel through the Mines of Moria. After finding the Dwarves of Moria dead, the Fellowship is attacked by Orcs and a cave troll. They hold them off but are confronted by Durin's Bane, a Balrog residing within the mines. Gandalf holds the Balrog at bay while the others escape. He casts it into a vast chasm, but the Balrog drags Gandalf down into the darkness with him. The devastated Fellowship reaches Lothlórien, ruled by the Elf-queen Galadriel. Galadriel privately informs Frodo that only he can complete the quest and that one of his friends in the Fellowship will try to take the Ring. Meanwhile, Saruman creates an army of Uruk-hai in Isengard to track down and kill the Fellowship.\n\nThe Fellowship travels by river to Parth Galen. Frodo wanders off and is confronted by Boromir, who tries to take the Ring as Lady Galadriel had predicted. The Fellowship is then ambushed by the Uruk-hai. Merry and Pippin are taken captive, and Boromir is mortally wounded by the Uruk chieftain. Aragorn arrives, slays the chieftain, and comforts Boromir as he dies. Afraid of the Ring corrupting his friends, Frodo decides to travel to Mordor alone, but then reconsiders by allowing Sam to come after hearing his promise from Gandalf. As Frodo and Sam make their way down the mountain pass of Emyn Muil, Aragorn, Legolas, and Gimli decide to rescue Merry and Pippin.",
  "Fight Club (1999)": "The Narrator, an automobile recall specialist, is unfulfilled by his job and possessions and suffers from chronic insomnia. To cure this he attends support groups, posing as a sufferer of diseases. His bliss is disturbed when another impostor, Marla Singer, begins attending the same groups. The two agree to split which groups they attend.\n\nOn a flight home from a business trip, the Narrator meets soap salesman Tyler Durden. The Narrator returns home to find his apartment and all his belongings have been destroyed by an explosion. Disheartened by his material loss, he calls Tyler and they meet at a bar. Tyler tells him he is trapped by consumerism. In the parking lot, he asks the Narrator to hit him, and they have a fistfight.\n\nThe Narrator moves into Tyler's home, a large dilapidated house in an industrial area. They have further fights outside the bar, which attract growing crowds of men. The fights move to the bar's basement where the men form Fight Club, which routinely meets.\n\nMarla overdoses on pills and telephones the Narrator for help; he ignores her, but Tyler goes to her apartment to save her. They begin a sexual relationship, much to the Narrator's irritation. Tyler warns the Narrator never to talk to Marla about him. The Narrator blackmails his boss for his company's assets to support Fight Club and quits his job.\n\nMore new members join Fight Club, including Robert \"Bob\" Paulson, a man with testicular cancer whom the Narrator had met in a support group. Tyler then recruits their members to a new anti-materialist and anti-corporate organization, Project Mayhem, without the Narrator's involvement. The group engages in subversive acts of vandalism, increasingly troubling the Narrator. After the Narrator complains that Tyler has excluded him, Tyler reveals that he was the one who caused the explosion at the Narrator's condo.\n\nWhen Paulson is killed by the police during a botched sabotage operation, the Narrator tries to halt the project. He follows a paper trail to cities Tyler had visited, discovering Project Mayhem has spread throughout the country. In one city, a project member addresses the Narrator as \"Mr. Durden.\" Confused, the Narrator calls Marla and discovers that she also believes he is Tyler. Tyler appears in his hotel room and reveals that they are dissociated personalities; the Narrator assumed the personality of Tyler when he believed he was sleeping.\n\nThe Narrator blacks out. When he returns to the house, he uncovers Tyler's plans to erase debt by destroying buildings that contain credit card records. He apologizes to Marla and warns her that she is in danger, but she is tired of his contradictory behavior and refuses to listen. He tries to warn the police, but the officers are members of the Project. He attempts to disarm the explosives in one building, but Tyler subdues him.\n\nWith Tyler holding him at gunpoint on the top floor, the Narrator realizes that, as he and Tyler are the same person, the Narrator is holding the gun. He fires it into his own mouth, shooting through his cheek. Tyler dies, and the Narrator ceases mentally projecting him. Project Mayhem members bring a kidnapped Marla to the building. Holding hands, the Narrator and Marla watch as the explosives detonate, collapsing buildings around them.",
  "Forrest Gump (1994)": "In 1981, at a bus stop in Savannah, Georgia, a man named Forrest Gump recounts his life story to strangers who sit next to him on a bench.\n\nIn 1951, in Greenbow, Alabama, young Forrest is fitted with leg braces to correct a curved spine, and is unable to walk properly. He lives alone with his mother, who runs a boarding house out of their home that attracts many tenants, including a young Elvis Presley, who plays the guitar for Forrest and incorporates Forrest's jerky dance movements into his performances. On his first day of school, Forrest meets a girl named Jenny Curran, and the two become best friends.\n\nForrest is often bullied because of his physical disability and low intelligence. While fleeing from several bullies, his leg braces break off, revealing Forrest to be a very fast runner. This talent eventually allows him to receive a football scholarship at the University of Alabama in 1963, where he is coached by Bear Bryant; he witnesses Governor George Wallace's stand in the schoolhouse door at which he returns a dropped book to Vivian Malone Jones, becomes a top kick returner, is named on the All-American team, and meets President John F. Kennedy at the White House.\n\nAfter graduating college in 1967, Forrest enlists into the U.S. Army. During basic training, he befriends a fellow soldier nicknamed \"Bubba\", who convinces Forrest to go into the shrimping business with him after their service. In 1968, they are sent to Vietnam, serving with the 9th Infantry Division in the Mekong Delta region. After months of routine operations, their platoon is ambushed while on patrol, and Bubba is killed in action. Forrest saves several wounded platoon mates—including his lieutenant, Dan Taylor, who loses both his legs—and is awarded the Medal of Honor for his heroism by President Lyndon B. Johnson.\n\nAt the anti-war \"March on the Pentagon\" rally, Forrest meets a man who \"had an American flag for a shirt\" and briefly reunites with Jenny, who has been living a hippie lifestyle. He also develops a talent for ping-pong, and becomes a sports celebrity as he competes against Chinese teams in ping-pong diplomacy, earning him an interview alongside John Lennon on The Dick Cavett Show. He spends the holidays and the 1972 new year in New York City with Lieutenant Dan, who has become bitter due to the loss of his legs. Forrest soon meets President Richard Nixon and is put up in the Watergate complex, where he accidentally witnesses and reports some men with flashlights in the building keeping him awake. Forrest is eventually discharged from the army.\n\nReturning to Greenbow, Forrest endorses a company that makes ping-pong paddles. He uses the earnings to buy a shrimping boat in Bayou La Batre, fulfilling his promise to Bubba. Lieutenant Dan joins Forrest in 1974, and they initially have little success. After their boat becomes the only one to survive Hurricane Carmen, they pull in huge amounts of shrimp and create the Bubba Gump Shrimp Company, after which Lieutenant Dan finally thanks Forrest for saving his life. Lieutenant Dan invests into what Forrest thinks is ”some kind of fruit company” and the two become millionaires, but Forrest also gives half of the earnings to Bubba's family. Forrest then returns home to see his mother as she dies of cancer.\n\nIn 1976, Jenny—in the midst of recovering from years of drugs and abuse—returns to visit Forrest, and after a while he proposes to her. That night she tells Forrest she loves him and the two make love, but she leaves the next morning. Heartbroken, Forrest goes running, and spends the next three years in a relentless cross-country marathon, becoming famous again. He eventually decides that he's grown tired of running (metaphorically and physically) and returns home to Greenbow.\n\nBack in 1981, Forrest reveals that he is waiting at the bus stop because he received a letter from Jenny, who asked him to visit her. As Forrest is finally reunited with Jenny, she introduces him to their son, named Forrest Gump, Jr. Jenny tells Forrest she is sick with an unknown virus and the three move back to Greenbow. Jenny and Forrest finally marry, but she dies a year later. The film ends with Forrest seeing his son off on his first day of school.",
  "Inception (2010)": "Dominick \"Dom\" Cobb and Arthur are \"extractors\"; they perform corporate espionage using experimental military technology to infiltrate their targets' subconscious and extract information through a shared dream world. Their latest target, Saito, reveals he arranged their mission to test Cobb for a seemingly impossible job: implanting an idea in a person's subconscious, or \"inception\". Saito wants Cobb to convince Robert, the son of Saito's competitor Maurice Fischer, to dissolve his father's company. Saito promises to clear Cobb's criminal status, which prevents him from returning home to his children.\n\nCobb accepts the offer and assembles his team: Eames, an identity forger; Yusuf, a chemist with a sedative for the \"dream within a dream\" strategy; and Ariadne – an architecture student of his father-in-law, Professor Stephen Miles – tasked with designing the dream's labyrinth. Ariadne discovers that Cobb's subconscious houses an invasive projection of his late wife, Mal. After Fischer dies, the team accompanies Robert on a flight where they sedate him into a shared dream. At each dream level, the person generating the dream stays behind to set up a \"kick\" to awaken other team members from the deeper dream. These kicks must occur simultaneously, despite time flowing faster in each successive level.\n\nThe first level is Yusuf's dream of Los Angeles. The team abducts Robert, but are attacked by projections from his subconscious. Saito is wounded, and Cobb reveals that while dying in the dream would normally waken dreamers, the sedatives will instead send them into \"limbo\": a world of infinite subconscious. Eames impersonates Robert's godfather, Peter Browning, to suggest that Robert reconsider his father's will. Cobb tells Ariadne that he and Mal entered limbo while experimenting with the dream-sharing technology. Sedated for five hours of real time, they spent fifty years in a dream world. When Mal refused to return to reality, Cobb used a form of inception by reactivating her totem, an object dreamers use to distinguish dreams from reality. After waking up, Mal still believed she was dreaming. Attempting to \"wake up\", she committed suicide and framed Cobb to force him to do the same. Cobb fled the U.S., leaving his children in Miles' care.\n\nYusuf drives the team around the first level as they are sedated into the second level, a hotel dreamed by Arthur. Cobb persuades Robert that he has been kidnapped by Browning, and that Cobb is his subconscious protector, leading Robert yet another level deeper as part of a ruse to enter Robert's subconscious. In the third level, the team infiltrate a fortified mountain hospital dreamed by Eames, and hold off the guards as Saito takes Robert into the equivalent of his subconscious. Yusuf, pursued by Robert's projections in the first level, deliberately drives off a bridge, initiating his kick too soon. This causes an avalanche in Eames' level, and removes gravity on Arthur's level, forcing Arthur to improvise a new kick synchronized with the van hitting the water. Mal's projection emerges in Eames' level and kills Robert; Cobb kills Mal, and Saito succumbs to his wounds. Cobb and Ariadne enter limbo to rescue Robert and Saito, while Eames prepares a kick by rigging the hospital with explosives.\n\nCobb makes peace with Mal's death. Ariadne kills Mal's projection and wakes up Robert with a kick. Revived into the third level, he discovers the planted idea: a projection of his dying father telling him to be his own man. While Cobb searches for Saito in limbo, the others ride the kicks back to reality. Cobb finds an aged Saito and reminds him of their agreement. The dreamers all awaken on the plane, and Saito makes a phone call. Arriving at Los Angeles International Airport, Cobb passes the immigration checkpoint and Miles accompanies him to his home. Cobb uses Mal's totem – a top that spins indefinitely in a dream – to test if he is indeed in the real world, but chooses not to observe the result and instead joins his children.",
  "The Lord of the Rings: The Two Towers (2002)": "Awakening from a dream of Gandalf fighting the Balrog in Moria, Frodo Baggins and Samwise Gamgee find themselves lost in the Emyn Muil near Mordor and discover they are being tracked by Gollum, a former bearer of the One Ring. Capturing Gollum, Frodo takes pity and allows him to guide them, reminding Sam that they will need Gollum's help to infiltrate Mordor.\n\nAragorn, Legolas, and Gimli pursue a band of Uruk-hai to save their companions Merry and Pippin, entering the kingdom of Rohan. The Uruk-hai are ambushed by a group of Rohirrim, allowing the Hobbits to escape into Fangorn Forest. Meeting Aragorn's group, the Rohirrim's leader Éomer explains that he and his men have been exiled by Rohan's king, Théoden, who is under the control of Saruman and his servant Gríma Wormtongue. Éomer believes Merry and Pippin were killed during the raid but leaves the group two horses. Searching for the Hobbits in Fangorn, Aragorn's group encounters Gandalf, who reveals that after his fight against the Balrog he was resurrected as Gandalf the White to help save Middle-earth.\n\nGandalf leads the trio to Rohan's capital, Edoras, where Gandalf frees Théoden from Saruman's control. Aragorn stops Théoden from executing Wormtongue, who flees. Learning of Saruman's plans to destroy Rohan with his Uruk-hai army, Théoden evacuates his citizens to the fortress of The Hornburg at Helm's Deep. Gandalf departs to find Éomer and his followers, hoping they will fight for their restored king. Aragorn befriends Théoden's niece, Éowyn, who becomes infatuated with him. When the refugees travelling to Helm's Deep are attacked by Saruman's Warg-riding Orcs, Aragorn falls from a cliff and is presumed dead. He is found by his horse Brego and rides to Helm's Deep, witnessing Saruman's army marching to the fortress.\n\nIn Rivendell, Arwen is told by her father Elrond that Aragorn will not return. He reminds her that if she remains in Middle-earth, she will outlive Aragorn by thousands of years, and she reluctantly departs for Valinor. Elrond is contacted by Galadriel of Lothlórien, who convinces him that the Elves should honour their alliance to men, and they dispatch an army of Elves to Helm's Deep.\n\nIn Fangorn, Merry and Pippin meet Treebeard, an Ent. Convincing Treebeard that they are allies, they are brought to an Ent Council, where the Ents decide not to take part in the coming war. Pippin asks Treebeard to take them in the direction of Isengard, where they witness the deforestation caused by Saruman's war effort. Enraged, Treebeard and the Ents storm Isengard, trapping Saruman in his tower.\n\nAragorn arrives at Helm's Deep and reveals that Saruman's army is close and Théoden must prepare for battle despite being vastly outnumbered. The army of Elves from Lothlórien arrives, as does Saruman's army, and a battle ensues. The Uruk-hai breach the outer wall with explosives and kill the Elves' commander, Haldir. The defenders retreat into the keep, where Aragorn convinces Théoden to meet the Uruk-hai in one last charge. At dawn, as the defenders are overwhelmed, Gandalf and Éomer arrive with the Rohirrim, turning the tide of the battle. The surviving Uruk-hai flee into Fangorn Forest and are killed by the Ents. Gandalf warns that Sauron will retaliate.\n\nGollum leads Frodo and Sam through the Dead Marshes to the Black Gate, but recommends they enter Mordor by another route. Frodo and Sam are captured by Rangers of Ithilien led by Faramir, brother of the late Boromir. Frodo helps Faramir catch Gollum to save him from being killed by the Rangers. Learning of the One Ring, Faramir takes his captives to Gondor to bring the ring to his father Denethor. Passing through the besieged city of Osgiliath, Frodo tries to explain to Faramir the true nature of the ring, and Sam explains that Boromir was driven mad by its power. A Nazgûl nearly captures Frodo, who falls under the ring's power and momentarily attacks Sam, who reminds him that they are fighting for the good still left in Middle-earth. Impressed by Frodo's resolve, Faramir releases them. Gollum decides to betray Frodo and reclaim the Ring by leading the group to \"Her\" upon arriving at Cirith Ungol.",
  "Star Wars: Episode V – The Empire Strikes Back (1980)": "Three years after the destruction of the Death Star, the Rebel Alliance, led by Princess Leia, have established a new base on the ice planet Hoth. The Imperial fleet, led by a merciless Darth Vader, hunts for the new Rebel base by dispatching probe droids across the galaxy. Luke Skywalker is captured by a wampa while investigating one such probe and dragged into the creature's cave, but manages to escape after using the Force to retrieve his lightsaber. Before Luke succumbs to hypothermia, the Force spirit of his deceased mentor, Obi-Wan Kenobi, instructs him to go to the swamp planet Dagobah to train under Jedi Master Yoda. Han Solo discovers Luke and manages to keep him alive by placing him inside the body of his dead Tauntaun mount, until the two are rescued by a search party the following morning.\n\nThe probe alerts the Imperial fleet to the Rebels' location. The Empire launches a large-scale attack using AT-AT walkers, forcing the Rebels to evacuate their base. Han and Leia escape with C-3PO and Chewbacca on the Millennium Falcon, but the ship's hyperdrive malfunctions. While they hide in an asteroid field, where Han and Leia become romantic amidst the tensions, Vader hires several bounty hunters to find the Falcon. Meanwhile, Luke travels with R2-D2 in his X-wing fighter to Dagobah, where he crash-lands. He meets a diminutive creature who later reveals himself to be Yoda; the Jedi master reluctantly accepts Luke as his apprentice after conferring with Obi-Wan's spirit. Luke learns more about the Force from Yoda, who uses it to lift the sunken X-wing out of the swamp.\n\nAfter evading the Imperial fleet, Han's group travels to the floating Cloud City on the planet Bespin, which is governed by Han's old friend Lando Calrissian. Bounty hunter Boba Fett tracks the Falcon and, with Vader, forces Lando to hand the group over to the Empire. Vader plans to use the group as bait to lure Luke, intending to capture and deliver him to the Emperor so that he could be turned to dark side of the Force. Luke experiences a premonition of Han and Leia in pain so against the wishes of Yoda and Obi-Wan, he abandons his training to rescue them.\n\nVader intends to hold Luke in suspended animation by imprisoning him in carbonite, selecting Han to be frozen as an experiment. Han survives the process and is given to Fett, who plans to collect a bounty on him from Jabba the Hutt. Lando has a change of heart and frees Leia and Chewbacca, but they are too late to stop Fett from departing with Han. Under attack from stormtroopers, they fight their way back to the Falcon and flee the city.\n\nMeanwhile, Luke arrives and engages Vader in a lightsaber duel that leads them over Cloud City's central air shaft. Vader severs Luke's right hand, disarming him, and tempts him to embrace his anger and join the dark side. Luke refuses and accuses Vader of killing his father, only for Vader to reveal that he is Luke's father. Disbelieving the truth, Luke drops into the air shaft and is ejected beneath the floating city, where he grabs hold of an antenna. He reaches out telepathically to Leia, who senses him and persuades Lando and Chewbacca to turn back. After Luke is brought aboard, they are chased by TIE fighters towards Vader on his Star Destroyer, and discover that the Falcon's hyperdrive has been sabotaged. R2-D2 reactivates it, allowing them to escape.\n\nThe group rejoins the Rebel fleet, where Luke's severed hand is replaced with a robotic prosthesis. Lando and Chewbacca begin their quest to find Han, as the other rebels watch the Falcon depart.",
  "The Matrix (1999)": "At an abandoned hotel within a major city, a police squad corners a woman (later revealed as Trinity), who overpowers them with superhuman abilities. She flees, with the police and a group of mysterious suited Agents capable of similar superhuman feats pursuing her. She answers a ringing public telephone and vanishes just before the Agents crash a truck into the booth.\n\nComputer programmer Thomas Anderson, known by his hacking alias \"Neo\", feels something is wrong with the world and is puzzled by repeated online encounters with the phrase \"the Matrix\". Trinity contacts him and tells him a man named Morpheus has the answers he seeks. A team of Agents and police, led by Agent Smith, arrives at Neo's workplace searching for him. Though Morpheus attempts to guide Neo to safety via telephone, Neo is captured and coerced into helping the Agents locate Morpheus, whom they regard as a \"known terrorist\". Undeterred, Neo later meets Morpheus, who offers him a choice between two pills; red to reveal the truth about the Matrix, and blue to return him to his former life. After Neo swallows the red pill, his reality disintegrates, and he awakens in a liquid, slime-filled pod, naked, his muscles atrophied and weakened, among countless other humans attached to an elaborate electrical system. He is retrieved and brought aboard Morpheus's flying ship, the Nebuchadnezzar.\n\nAs Neo recuperates from a lifetime of physical inactivity from the pod, Morpheus explains the truth. In the early 21st century, there was a war between humans and intelligent machines. When humans blocked the machines' access to solar energy, the machines harvested the humans' bioelectric power, keeping them pacified in the Matrix, a shared simulated reality modeled after the world as it existed at the end of the 20th century. The machines have taken over the world; the city of Zion is the last refuge of free humans. Morpheus and his crew are a group of rebels who hack into the Matrix to \"unplug\" enslaved humans and recruit them; because they understand the Matrix's simulated nature, they can bend its physical laws. Morpheus warns Neo that death within the Matrix kills the physical body, and the Agents he met are powerful sentient computer programs that eliminate threats to the system, while machines called Sentinels destroy rebels in the real world. Neo's prowess during virtual combat training cements Morpheus's belief that Neo is \"the One\", an especially powerful human prophesied to free humanity and end the war.\n\nThe group enters the Matrix to visit the Oracle, the prophet who predicted the emergence of the One. She suggests to Neo that he is not the One and warns that he will have to choose between Morpheus's life and his own. Agents and tactical police, tipped by Cypher, a disgruntled crew member who betrays Morpheus in exchange for a comfortable life in the Matrix, ambush the group. Morpheus allows himself to be captured so the rest of the crew can escape. Cypher exits the Matrix first and murders several crew members as they lie defenseless in the real world. Before he can kill Neo, Cypher is killed by Tank, a crewman whom he only wounded.\n\nIn the Matrix, the Agents interrogate Morpheus to learn his access codes to the mainframe computer in Zion. Tank proposes killing Morpheus to prevent this, but Neo resolves to return to the Matrix to rescue Morpheus, as the Oracle prophesied; Trinity insists she accompany him. While rescuing Morpheus, Neo gains confidence in his abilities, performing feats comparable to the Agents'. Morpheus and Trinity exit the Matrix, but Smith ambushes and kills Neo before he can leave. As a group of Sentinels attack the Nebuchadnezzar, Trinity whispers to Neo that he cannot be dead, because she loves him and the Oracle told her she would fall in love with the One. She kisses Neo and he revives with newfound power to perceive and control the Matrix. He effortlessly defeats Smith, and leaves the Matrix just in time for the ship's electromagnetic pulse to disable the Sentinels.\n\nLater, Neo makes a telephone call inside the Matrix, promising the machines that he will show their prisoners \"a world where anything is possible\". He hangs up and flies into the sky.",
  "Goodfellas (1990)": "In 1955, a young Henry Hill becomes enamored of the criminal life and Mafia presence in his working class Italian-American neighborhood in Brooklyn. He begins working for local caporegime Paul \"Paulie\" Cicero and his associates: James \"Jimmy\" Conway, an Irish truck hijacker and gangster, and Tommy DeVito, a fellow juvenile delinquent. Henry begins as a fence for Jimmy, gradually working his way up to more serious crimes. The three associates spend most of their nights in the 1960s at the Copacabana nightclub carousing with women. Henry starts dating Karen Friedman, a Jewish woman. She is initially troubled by Henry's criminal activities but is eventually seduced by his glamorous lifestyle. She marries him, despite her parents' disapproval.\n\nIn 1970, Billy Batts, a made man in the Gambino crew who was recently released from prison, repeatedly insults Tommy at a nightclub owned by Henry; Tommy and Jimmy then beat, stab and shoot him to death. The unsanctioned murder of a made man invites retribution; realizing this, Jimmy, Henry, and Tommy cover up the murder by burying the body in Upstate New York. Six months later, however, Jimmy learns that the burial site is slated for development, prompting them to exhume and relocate the decomposing corpse.\n\nIn 1974, Karen harasses Henry's mistress Janice and holds Henry at gunpoint. Henry moves in with Janice, but Paulie insists that he should return to Karen after collecting a debt from a gambler in Tampa with Jimmy. Upon returning, Jimmy and Henry are arrested after being turned in by the gambler's sister, an FBI typist, and they receive ten-year prison sentences. In order to support his family on the outside, Henry has drugs smuggled in by Karen and sells them to a fellow inmate from Pittsburgh. In 1978, Henry is paroled and expands this cocaine business against Paulie's orders, soon involving Jimmy and Tommy.\n\nJimmy organizes a crew to raid the Lufthansa vault at the JFK Airport, stealing several millions in cash and jewelry. After some members purchase expensive items against Jimmy's orders and the getaway truck is found by police, he has most of the crew murdered. In his voiceover narration, as dead bodies are being discovered all over the city, Henry theorizes that Jimmy would have killed them anyway rather than share the profits of the heist. Tommy and Henry are spared by Jimmy. Tommy is deceived into believing he has been proposed to be made; he is murdered on the way to the ceremony in retribution for Batts's murder, leaving Jimmy devastated.\n\nBy 1980, Henry has become a nervous wreck from cocaine use and insomnia. He sets up a drug deal with his Pittsburgh associates, but is arrested by narcotics agents, and jailed. After bailing him out, Karen explains that she flushed $60,000 worth of cocaine down the toilet to prevent FBI agents from finding it during their raid, leaving them virtually penniless. Feeling betrayed by Henry's drug dealing, Paulie gives him $3,200 and ends their association. Henry meets Jimmy at a diner and is asked to travel on a hit assignment, but the novelty of such a request makes him suspicious. Henry realizes that Jimmy plans to have him and Karen killed, prompting his decision to become an informant and enroll, with his family, in the witness protection program. He gives sufficient testimony to have Paulie and Jimmy arrested and convicted. Henry is grateful to be alive, but he is forced out of his gangster life and has to readjust to normal life once again; he narrates, \"I'm an average nobody. I get to live the rest of my life like a schnook.\"\n\nThe end title cards state that Henry is still a protected witness as of 1990, but that he was arrested in 1987 in Seattle for narcotics conspiracy, receiving five years' probation. He has been clean since then. He and Karen separated in 1989 after 25 years of marriage, while Paulie died the previous year in Fort Worth Federal Prison at age 73 from respiratory illness. Jimmy was serving a 20 years to life sentence in a New York prison for murder, in which he would have been paroled in 2004 at 78 years old.",
  "One Flew Over the Cuckoo's Nest (1975)": "In Oregon in 1963, Randle Patrick McMurphy is serving a prison sentence for assault and statutory rape of a 15-year-old girl. He gets himself transferred to a mental institution to avoid hard labor. At the hospital, he finds the ward is being dominated by head nurse Mildred Ratched, a cold, passive-aggressive tyrant who uses her authority to intimidate her patients.\n\nThe other patients include anxious, stuttering 21-year-old Billy Bibbit; Charlie Cheswick, who is prone to childish tantrums; delusional and innocent Martini; the articulate, repressed homosexual Dale Harding; belligerent and profane Max Taber; epileptics Jim Sefelt and Bruce Fredrickson, the former of whom gives his medicine to the latter; quiet but violent-minded Scanlon; \"Chief\" Bromden, a very tall Native American who acts as a deaf-mute (though later in the film, he can obviously hear and speak); and several others with chronic conditions.\n\nRatched sees McMurphy's lively, rebellious presence as a threat to her authority; she confiscates the patients' cigarettes and rations them, and suspends their card-playing privileges. McMurphy finds himself in a battle of wills against Ratched. He steals a school bus, escaping with several patients to go fishing and swimming on the Pacific Ocean Coast, encouraging his fellow patients to discover their own abilities and find self-confidence.\n\nAfter an orderly tells him that the judge's time sentence doesn't apply for people who are deemed to be criminally insane, McMurphy makes plans to escape, encouraging Chief Bromden to throw a hydrotherapy console through a window. It is also revealed that McMurphy, Chief, and Taber are the only non-chronic patients involuntarily committed to the institution; the rest of them are self-committed and could leave at any time, but are too afraid to do so. After Cheswick bursts into a fit demanding his cigarettes, McMurphy fights with the orderlies, and Chief intervenes.\n\nRatched sends Chief, Cheswick, and McMurphy to the \"shock shop\" as a result of this insubordination. While awaiting their punishment, McMurphy offers Chief a stick of gum, and discovers he can speak and hear, having feigned his deaf-muteness to avoid engaging with anyone. After being subjected to electroconvulsive therapy, McMurphy returns to the ward pretending to be brain damaged. McMurphy reveals the treatment has made him even more determined to defeat Ratched. McMurphy and Chief make plans to escape, but decide to throw a secret Christmas party for their friends after Ratched and the orderlies leave for the night.\n\nMcMurphy sneaks two women, Candy and Rose, and bottles of alcohol into the ward; he bribes guard Turkle to allow this. After a party, McMurphy and Chief prepare to escape, inviting Billy to come with them. Billy refuses, but asks for a \"date\" with Candy; McMurphy arranges for him to have sex with her. McMurphy and the others get drunk, and McMurphy falls asleep instead of making his escape with Chief.\n\nRatched arrives in the morning to find the ward in disarray and most of the patients passed out. She discovers Billy and Candy together, and aims to embarrass Billy in front of everyone. Billy manages to overcome his stutter and stand-up to Ratched. When she threatens to tell his mother about Candy, Billy cracks under the pressure and reverts to stuttering. Ratched has him placed in the doctor’s office. Moments later, McMurphy punches an orderly when trying to escape out of a window with the Chief, causing other orderlies to intervene. Meanwhile, Billy commits suicide. McMurphy and the other patients witness the aftermath, Ratched tries to ease the situation by calling for the day's routine to continue as usual, and an enraged McMurphy attempts to strangle Ratched. The orderlies subdue McMurphy, saving her life.\n\nSome time later, Ratched is seen wearing a neck brace and speaking with a feeble voice, and Harding now leads the now-unsuspended card-playing. McMurphy is nowhere to be found, causing rumors that he has escaped. Later that night, Chief sees McMurphy being returned to his bed. He greets him, elated that McMurphy had kept his promise not to escape without him, but notices McMurphy is unresponsive and physically limp, and discovers lobotomy scars on his forehead. Chief tearfully hugs McMurphy and says, \"You're coming with me,\" and smothers McMurphy to death with a pillow. He then lifts the hydrotherapy fountain off the floor, smashes it through the window and window gates, and escapes.",
  "Seven Samurai (1954)": "In 1587, bandits discuss raiding a mountain village, but their chief decides to wait until after the harvest as they had raided it fairly recently. They are overheard by a farmer, whereupon the villagers ask Gisaku, the village elder and miller, for advice. He states that he once saw a village that hired samurai and remained untouched by raiders, and declares they should also hire samurai to defend them. Since they have no money and can only offer food as payment, Gisaku advises them to find hungry samurai.\n\nAfter having little initial success, the scouting party watches Kambei, an aging but experienced rōnin, rescue a young boy who had been held hostage by a cornered thief. A young samurai named Katsushirō asks to become Kambei's disciple. The villagers then ask for help, and after initial reluctance, Kambei agrees. He recruits his old friend Shichirōji and, with Katsushirō's assistance, three other samurai: the friendly, wily Gorobei; the good-natured Heihachi; and Kyūzō, a taciturn master swordsman whom Katsushirō regards with awe. Although inexperienced, Katsushirō is accepted because time is short. Kikuchiyo, a wild and unpredictable man who carries a family scroll that he claims proves he is a samurai (though the birth date on it is for a teenager), follows the group despite attempts to drive him away.\n\nOn arrival, the samurai find the villagers cowering in their homes, refusing to greet them. Feeling insulted by such a cold reception, Kikuchiyo rings the village alarm, prompting the villagers to come out of hiding and beg for protection. The samurai are both pleased and amused by this, and accept him as a comrade-in-arms. Slowly the samurai and farmers begin to trust each other as they train together. Katsushirō forms a relationship with Shino, a farmer's daughter, who is masquerading at her father's insistence as a boy for protection from the supposedly lustful samurai. However, the six professional samurai are angered when Kikuchiyo brings them armor and weapons, which the villagers most likely acquired by killing injured or dying samurai. Kikuchiyo retorts in a rage that samurai are responsible for battles, raids, taxation and forced labor that devastate the villagers' lives. By so doing, he reveals his origin as an orphaned farmer's son. The samurai's anger turns to shame. Kambei divides the villagers up into squads to harvest and train.\n\nThree bandit scouts are spotted. Two are killed; the survivor reveals the location of their camp. Against the wishes of the samurai, the villagers kill the prisoner. The samurai burn down the bandits' camp in a pre-emptive strike. Rikichi, a troubled villager who helps the samurai, breaks down when he sees his wife, who had apparently been kidnapped and made a concubine in a previous raid. On seeing Rikichi, she walks back into the burning hut. Heihachi is killed by musket fire while trying to save Rikichi, whose grief is compounded.\n\nWhen the bandits finally attack, they are confounded by new fortifications, including a moat and wooden fence. Several bandits are killed following Kambei's plan of allowing single horse-mounted bandits to enter the village, where they are trapped and killed by groups of farmers armed with bamboo spears. Gisaku's family tries to save the old man when he refuses to abandon his mill on the outskirts of the village. All perish but a lone baby rescued by Kikuchiyo, who breaks down in tears, as it reminds him how he was orphaned.\n\nThe bandits possess three matchlock firearms. Kyūzō ventures out alone and returns with one. An envious Kikuchiyo abandons his post—and his contingent of farmers—to bring back another. He is chastised by Kambei because, while he was gone, the bandits killed some of his farmers. The bandits attack again, and Gorobei is slain. That night, Kambei predicts that, due to their dwindling numbers, the bandits will make one last all-out attack. Meanwhile, Katsushirō and Shino's relationship is discovered by her father. He beats her until Kambei and the villagers intervene. Shichirōji calms everyone down by saying the couple should be forgiven because they are young and that passions can run high before any battle.\n\nThe next morning in a torrential downpour, Kambei orders that the remaining thirteen bandits be allowed into the village and then attacked. As the battle winds down, their leader, armed with a gun, hides in the women's hut and shoots Kyūzō. An enraged Kikuchiyo charges in and is shot, but kills the bandit chief before dying. The rest of the invaders are slain.\n\nThe three surviving samurai later watch from the funeral mounds of their comrades as the joyful villagers sing whilst planting their crops. Kambei reflects that it is another pyrrhic victory for the warriors: \"In the end, we lost this battle too. The victory belongs to the peasants, not to us.\"",
  "Se7en (1995)": "Soon-to-retire Detective Lieutenant William Somerset is partnered with short-tempered but idealistic Detective David Mills, who has recently moved to an unnamed large city with his wife Tracy. After forming a friendship with Somerset, Tracy confides to him that she is pregnant and has yet to tell Mills, as she is unhappy with the city and feels it is no place to raise a child. Somerset sympathizes, having had a similar situation with his ex-girlfriend many years earlier, and advises her to tell Mills only if she plans to keep the child.\n\nSomerset and Mills investigate a set of murders inspired by the seven deadly sins: a morbidly obese man forced to eat until his stomach burst, representing gluttony, and a criminal defense attorney killed after being forced to cut a pound of flesh from himself, representing greed. Clues at the murder scenes lead them to a suspect's apartment, where they find a third victim, a drug dealer and child molester, strapped to a bed, emaciated and barely alive, representing sloth. The third victim is in critical condition and unable to respond to Somerset and Mills' questioning. Daily photographs of the victim, taken over a year, show the crimes were planned far in advance.\n\nThe detectives use library records to identify a John Doe and track him to his apartment. Doe flees and Mills gives chase, during which Mills falls from a fire escape and injures his arm. Mills searches a truck before being struck in the head with a tire iron. While Mills is incapacitated, Doe walks up and holds him at gunpoint for a moment before escaping. The apartment contains hundreds of notebooks revealing Doe's psychopathy, as well as a clue to another murder. The detectives arrive too late to stop a man forced by Doe at gunpoint to kill a prostitute by raping her with a custom-made, bladed strap-on, representing lust. The following day, they attend the scene of a fifth victim, a model whose face has been mutilated by Doe; she was given the option to call for help and live disfigured, or commit suicide by taking pills, representing pride.\n\nAs Somerset and Mills return to the police station, Doe turns himself in, covered in the blood of an unidentified victim. Doe offers to take the detectives to the final two victims and confess to the murders, but only under specific terms, or he will plead insanity. Somerset is wary, but Mills agrees.\n\nDoe's directions lead the detectives to a remote deserted location, and within minutes, a delivery van approaches. Mills holds Doe at gunpoint while Somerset intercepts the driver, who says he was instructed to bring a box to them. Doe begins to taunt Mills, telling him how envious he was of his life with Tracy. Somerset opens the box and, in a sudden panic, warns Mills to stay back. Doe states that his sin was envy, and Tracy died as a result, implying that the box contains her decapitated head. Goading Mills, he reveals Tracy begged for her life and that of her baby, expressing surprise and delight when he realizes Mills was unaware she was pregnant. Despite Somerset's warnings, Mills fatally shoots Doe, representing wrath, and completing Doe's plan. Somerset and the police captain watch as the devastated Mills is taken away, and Somerset offers Mills help. When the captain asks where he'll be, Somerset replies, \"Around. I will be around.\" In a voiceover, he then quotes Hemingway: \"Ernest Hemingway once wrote 'The world is a fine place and worth fighting for.' I agree with the second part.\""
}
